/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub const KAUTH_VNODE_GENERIC_ALL_BITS: u32 = 8190;
pub const KAUTH_VNODE_WRITE_RIGHTS: u32 = 100676980;
pub const __DARWIN_ACL_READ_DATA: u32 = 2;
pub const __DARWIN_ACL_LIST_DIRECTORY: u32 = 2;
pub const __DARWIN_ACL_WRITE_DATA: u32 = 4;
pub const __DARWIN_ACL_ADD_FILE: u32 = 4;
pub const __DARWIN_ACL_EXECUTE: u32 = 8;
pub const __DARWIN_ACL_SEARCH: u32 = 8;
pub const __DARWIN_ACL_DELETE: u32 = 16;
pub const __DARWIN_ACL_APPEND_DATA: u32 = 32;
pub const __DARWIN_ACL_ADD_SUBDIRECTORY: u32 = 32;
pub const __DARWIN_ACL_DELETE_CHILD: u32 = 64;
pub const __DARWIN_ACL_READ_ATTRIBUTES: u32 = 128;
pub const __DARWIN_ACL_WRITE_ATTRIBUTES: u32 = 256;
pub const __DARWIN_ACL_READ_EXTATTRIBUTES: u32 = 512;
pub const __DARWIN_ACL_WRITE_EXTATTRIBUTES: u32 = 1024;
pub const __DARWIN_ACL_READ_SECURITY: u32 = 2048;
pub const __DARWIN_ACL_WRITE_SECURITY: u32 = 4096;
pub const __DARWIN_ACL_CHANGE_OWNER: u32 = 8192;
pub const __DARWIN_ACL_SYNCHRONIZE: u32 = 1048576;
pub const __DARWIN_ACL_EXTENDED_ALLOW: u32 = 1;
pub const __DARWIN_ACL_EXTENDED_DENY: u32 = 2;
pub const __DARWIN_ACL_ENTRY_INHERITED: u32 = 16;
pub const __DARWIN_ACL_ENTRY_FILE_INHERIT: u32 = 32;
pub const __DARWIN_ACL_ENTRY_DIRECTORY_INHERIT: u32 = 64;
pub const __DARWIN_ACL_ENTRY_LIMIT_INHERIT: u32 = 128;
pub const __DARWIN_ACL_ENTRY_ONLY_INHERIT: u32 = 256;
pub const __DARWIN_ACL_FLAG_NO_INHERIT: u32 = 131072;
pub const ACL_MAX_ENTRIES: u32 = 128;
pub const __COREFOUNDATION_CFSTRINGTOKENIZER__: u32 = 1;
pub const __COREFOUNDATION_CFFILEDESCRIPTOR__: u32 = 1;
pub const __COREFOUNDATION_CFUSERNOTIFICATION__: u32 = 1;
pub const __COREFOUNDATION_CFXMLNODE__: u32 = 1;
pub const __CFXMLNode_DEPRECATION_MSG: &[u8; 83] =
    b"CFXMLNode is deprecated, use NSXMLParser, NSXMLDocument or libxml2 library instead\0";
pub const __COREFOUNDATION_CFXMLPARSER__: u32 = 1;
pub const __CFXMLParser_DEPRECATION_MSG: &[u8; 85] =
    b"CFXMLParser is deprecated, use NSXMLParser, NSXMLDocument or libxml2 library instead\0";
pub const NSGEOMETRY_TYPES_SAME_AS_CGGEOMETRY_TYPES: u32 = 1;
pub const NSEDGEINSETS_DEFINED: u32 = 1;
pub const NSMaximumStringLength: u32 = 2147483646;
pub const NS_UNICHAR_IS_EIGHT_BIT: u32 = 0;
pub const NSFoundationVersionWithFileManagerResourceForkSupport: u32 = 412;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type pid_t = __darwin_pid_t;
pub type id_t = __darwin_id_t;
pub type sig_atomic_t = ::std::os::raw::c_int;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state {
    pub __exception: __uint32_t,
    pub __fsr: __uint32_t,
    pub __far: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state"]
        [::std::mem::size_of::<__darwin_arm_exception_state>() - 12usize];
    ["Alignment of __darwin_arm_exception_state"]
        [::std::mem::align_of::<__darwin_arm_exception_state>() - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __exception) - 0usize];
    ["Offset of field: __darwin_arm_exception_state::__fsr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __fsr) - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __far) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64 {
    pub __far: __uint64_t,
    pub __esr: __uint32_t,
    pub __exception: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64"]
        [::std::mem::size_of::<__darwin_arm_exception_state64>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64"]
        [::std::mem::align_of::<__darwin_arm_exception_state64>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __esr) - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __exception) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state {
    pub __r: [__uint32_t; 13usize],
    pub __sp: __uint32_t,
    pub __lr: __uint32_t,
    pub __pc: __uint32_t,
    pub __cpsr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state"]
        [::std::mem::size_of::<__darwin_arm_thread_state>() - 68usize];
    ["Alignment of __darwin_arm_thread_state"]
        [::std::mem::align_of::<__darwin_arm_thread_state>() - 4usize];
    ["Offset of field: __darwin_arm_thread_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_thread_state::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __sp) - 52usize];
    ["Offset of field: __darwin_arm_thread_state::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __lr) - 56usize];
    ["Offset of field: __darwin_arm_thread_state::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __pc) - 60usize];
    ["Offset of field: __darwin_arm_thread_state::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __cpsr) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state64 {
    pub __x: [__uint64_t; 29usize],
    pub __fp: __uint64_t,
    pub __lr: __uint64_t,
    pub __sp: __uint64_t,
    pub __pc: __uint64_t,
    pub __cpsr: __uint32_t,
    pub __pad: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state64"]
        [::std::mem::size_of::<__darwin_arm_thread_state64>() - 272usize];
    ["Alignment of __darwin_arm_thread_state64"]
        [::std::mem::align_of::<__darwin_arm_thread_state64>() - 8usize];
    ["Offset of field: __darwin_arm_thread_state64::__x"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __x) - 0usize];
    ["Offset of field: __darwin_arm_thread_state64::__fp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __fp) - 232usize];
    ["Offset of field: __darwin_arm_thread_state64::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __lr) - 240usize];
    ["Offset of field: __darwin_arm_thread_state64::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __sp) - 248usize];
    ["Offset of field: __darwin_arm_thread_state64::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pc) - 256usize];
    ["Offset of field: __darwin_arm_thread_state64::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __cpsr) - 264usize];
    ["Offset of field: __darwin_arm_thread_state64::__pad"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pad) - 268usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_vfp_state {
    pub __r: [__uint32_t; 64usize],
    pub __fpscr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_vfp_state"][::std::mem::size_of::<__darwin_arm_vfp_state>() - 260usize];
    ["Alignment of __darwin_arm_vfp_state"]
        [::std::mem::align_of::<__darwin_arm_vfp_state>() - 4usize];
    ["Offset of field: __darwin_arm_vfp_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_vfp_state::__fpscr"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __fpscr) - 256usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state64 {
    pub __v: [__uint128_t; 32usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state64"]
        [::std::mem::size_of::<__darwin_arm_neon_state64>() - 528usize];
    ["Alignment of __darwin_arm_neon_state64"]
        [::std::mem::align_of::<__darwin_arm_neon_state64>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state64::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpsr) - 512usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpcr) - 516usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state {
    pub __v: [__uint128_t; 16usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state"]
        [::std::mem::size_of::<__darwin_arm_neon_state>() - 272usize];
    ["Alignment of __darwin_arm_neon_state"]
        [::std::mem::align_of::<__darwin_arm_neon_state>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpsr) - 256usize];
    ["Offset of field: __darwin_arm_neon_state::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpcr) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_pagein_state {
    pub __pagein_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_pagein_state"][::std::mem::size_of::<__arm_pagein_state>() - 4usize];
    ["Alignment of __arm_pagein_state"][::std::mem::align_of::<__arm_pagein_state>() - 4usize];
    ["Offset of field: __arm_pagein_state::__pagein_error"]
        [::std::mem::offset_of!(__arm_pagein_state, __pagein_error) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_legacy_debug_state {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_legacy_debug_state"]
        [::std::mem::size_of::<__arm_legacy_debug_state>() - 256usize];
    ["Alignment of __arm_legacy_debug_state"]
        [::std::mem::align_of::<__arm_legacy_debug_state>() - 4usize];
    ["Offset of field: __arm_legacy_debug_state::__bvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bvr) - 0usize];
    ["Offset of field: __arm_legacy_debug_state::__bcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bcr) - 64usize];
    ["Offset of field: __arm_legacy_debug_state::__wvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wvr) - 128usize];
    ["Offset of field: __arm_legacy_debug_state::__wcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wcr) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state32 {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state32"]
        [::std::mem::size_of::<__darwin_arm_debug_state32>() - 264usize];
    ["Alignment of __darwin_arm_debug_state32"]
        [::std::mem::align_of::<__darwin_arm_debug_state32>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state32::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state32::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bcr) - 64usize];
    ["Offset of field: __darwin_arm_debug_state32::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wvr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state32::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wcr) - 192usize];
    ["Offset of field: __darwin_arm_debug_state32::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __mdscr_el1) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state64 {
    pub __bvr: [__uint64_t; 16usize],
    pub __bcr: [__uint64_t; 16usize],
    pub __wvr: [__uint64_t; 16usize],
    pub __wcr: [__uint64_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state64"]
        [::std::mem::size_of::<__darwin_arm_debug_state64>() - 520usize];
    ["Alignment of __darwin_arm_debug_state64"]
        [::std::mem::align_of::<__darwin_arm_debug_state64>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state64::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state64::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bcr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state64::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wvr) - 256usize];
    ["Offset of field: __darwin_arm_debug_state64::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wcr) - 384usize];
    ["Offset of field: __darwin_arm_debug_state64::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __mdscr_el1) - 512usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_cpmu_state64 {
    pub __ctrs: [__uint64_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_cpmu_state64"]
        [::std::mem::size_of::<__darwin_arm_cpmu_state64>() - 128usize];
    ["Alignment of __darwin_arm_cpmu_state64"]
        [::std::mem::align_of::<__darwin_arm_cpmu_state64>() - 8usize];
    ["Offset of field: __darwin_arm_cpmu_state64::__ctrs"]
        [::std::mem::offset_of!(__darwin_arm_cpmu_state64, __ctrs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext32 {
    pub __es: __darwin_arm_exception_state,
    pub __ss: __darwin_arm_thread_state,
    pub __fs: __darwin_arm_vfp_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext32"][::std::mem::size_of::<__darwin_mcontext32>() - 340usize];
    ["Alignment of __darwin_mcontext32"][::std::mem::align_of::<__darwin_mcontext32>() - 4usize];
    ["Offset of field: __darwin_mcontext32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext32, __fs) - 80usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext64 {
    pub __es: __darwin_arm_exception_state64,
    pub __ss: __darwin_arm_thread_state64,
    pub __ns: __darwin_arm_neon_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext64"][::std::mem::size_of::<__darwin_mcontext64>() - 816usize];
    ["Alignment of __darwin_mcontext64"][::std::mem::align_of::<__darwin_mcontext64>() - 16usize];
    ["Offset of field: __darwin_mcontext64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext64::__ns"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ns) - 288usize];
};
pub type mcontext_t = *mut __darwin_mcontext64;
pub type pthread_attr_t = __darwin_pthread_attr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: __darwin_size_t,
    pub ss_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_sigaltstack"][::std::mem::size_of::<__darwin_sigaltstack>() - 24usize];
    ["Alignment of __darwin_sigaltstack"][::std::mem::align_of::<__darwin_sigaltstack>() - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_sp"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_sp) - 0usize];
    ["Offset of field: __darwin_sigaltstack::ss_size"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_size) - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_flags"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_flags) - 16usize];
};
pub type stack_t = __darwin_sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_ucontext {
    pub uc_onstack: ::std::os::raw::c_int,
    pub uc_sigmask: __darwin_sigset_t,
    pub uc_stack: __darwin_sigaltstack,
    pub uc_link: *mut __darwin_ucontext,
    pub uc_mcsize: __darwin_size_t,
    pub uc_mcontext: *mut __darwin_mcontext64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_ucontext"][::std::mem::size_of::<__darwin_ucontext>() - 56usize];
    ["Alignment of __darwin_ucontext"][::std::mem::align_of::<__darwin_ucontext>() - 8usize];
    ["Offset of field: __darwin_ucontext::uc_onstack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_onstack) - 0usize];
    ["Offset of field: __darwin_ucontext::uc_sigmask"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_sigmask) - 4usize];
    ["Offset of field: __darwin_ucontext::uc_stack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_stack) - 8usize];
    ["Offset of field: __darwin_ucontext::uc_link"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_link) - 32usize];
    ["Offset of field: __darwin_ucontext::uc_mcsize"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcsize) - 40usize];
    ["Offset of field: __darwin_ucontext::uc_mcontext"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcontext) - 48usize];
};
pub type ucontext_t = __darwin_ucontext;
pub type sigset_t = __darwin_sigset_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub sigev_notify_attributes: *mut pthread_attr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 32usize];
    ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
    ["Offset of field: sigevent::sigev_notify"]
        [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
    ["Offset of field: sigevent::sigev_signo"]
        [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
    ["Offset of field: sigevent::sigev_value"]
        [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
    ["Offset of field: sigevent::sigev_notify_function"]
        [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
    ["Offset of field: sigevent::sigev_notify_attributes"]
        [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: pid_t,
    pub si_uid: uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub si_band: ::std::os::raw::c_long,
    pub __pad: [::std::os::raw::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
    ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
    ["Offset of field: __siginfo::si_signo"][::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
    ["Offset of field: __siginfo::si_errno"][::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
    ["Offset of field: __siginfo::si_code"][::std::mem::offset_of!(__siginfo, si_code) - 8usize];
    ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
    ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
    ["Offset of field: __siginfo::si_status"]
        [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
    ["Offset of field: __siginfo::si_addr"][::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
    ["Offset of field: __siginfo::si_value"][::std::mem::offset_of!(__siginfo, si_value) - 32usize];
    ["Offset of field: __siginfo::si_band"][::std::mem::offset_of!(__siginfo, si_band) - 40usize];
    ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
};
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut __siginfo,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
    ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
    ["Offset of field: __sigaction_u::__sa_handler"]
        [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
    ["Offset of field: __sigaction_u::__sa_sigaction"]
        [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_tramp: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: *mut siginfo_t,
            arg5: *mut ::std::os::raw::c_void,
        ),
    >,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction"][::std::mem::size_of::<__sigaction>() - 24usize];
    ["Alignment of __sigaction"][::std::mem::align_of::<__sigaction>() - 8usize];
    ["Offset of field: __sigaction::__sigaction_u"]
        [::std::mem::offset_of!(__sigaction, __sigaction_u) - 0usize];
    ["Offset of field: __sigaction::sa_tramp"]
        [::std::mem::offset_of!(__sigaction, sa_tramp) - 8usize];
    ["Offset of field: __sigaction::sa_mask"]
        [::std::mem::offset_of!(__sigaction, sa_mask) - 16usize];
    ["Offset of field: __sigaction::sa_flags"]
        [::std::mem::offset_of!(__sigaction, sa_flags) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sigaction_u"]
        [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
};
pub type sig_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigvec {
    pub sv_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub sv_mask: ::std::os::raw::c_int,
    pub sv_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigvec"][::std::mem::size_of::<sigvec>() - 16usize];
    ["Alignment of sigvec"][::std::mem::align_of::<sigvec>() - 8usize];
    ["Offset of field: sigvec::sv_handler"][::std::mem::offset_of!(sigvec, sv_handler) - 0usize];
    ["Offset of field: sigvec::sv_mask"][::std::mem::offset_of!(sigvec, sv_mask) - 8usize];
    ["Offset of field: sigvec::sv_flags"][::std::mem::offset_of!(sigvec, sv_flags) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_char,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
};
unsafe extern "C" {
    pub fn signal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type rlim_t = __uint64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage {
    pub ru_utime: timeval,
    pub ru_stime: timeval,
    pub ru_maxrss: ::std::os::raw::c_long,
    pub ru_ixrss: ::std::os::raw::c_long,
    pub ru_idrss: ::std::os::raw::c_long,
    pub ru_isrss: ::std::os::raw::c_long,
    pub ru_minflt: ::std::os::raw::c_long,
    pub ru_majflt: ::std::os::raw::c_long,
    pub ru_nswap: ::std::os::raw::c_long,
    pub ru_inblock: ::std::os::raw::c_long,
    pub ru_oublock: ::std::os::raw::c_long,
    pub ru_msgsnd: ::std::os::raw::c_long,
    pub ru_msgrcv: ::std::os::raw::c_long,
    pub ru_nsignals: ::std::os::raw::c_long,
    pub ru_nvcsw: ::std::os::raw::c_long,
    pub ru_nivcsw: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage"][::std::mem::size_of::<rusage>() - 144usize];
    ["Alignment of rusage"][::std::mem::align_of::<rusage>() - 8usize];
    ["Offset of field: rusage::ru_utime"][::std::mem::offset_of!(rusage, ru_utime) - 0usize];
    ["Offset of field: rusage::ru_stime"][::std::mem::offset_of!(rusage, ru_stime) - 16usize];
    ["Offset of field: rusage::ru_maxrss"][::std::mem::offset_of!(rusage, ru_maxrss) - 32usize];
    ["Offset of field: rusage::ru_ixrss"][::std::mem::offset_of!(rusage, ru_ixrss) - 40usize];
    ["Offset of field: rusage::ru_idrss"][::std::mem::offset_of!(rusage, ru_idrss) - 48usize];
    ["Offset of field: rusage::ru_isrss"][::std::mem::offset_of!(rusage, ru_isrss) - 56usize];
    ["Offset of field: rusage::ru_minflt"][::std::mem::offset_of!(rusage, ru_minflt) - 64usize];
    ["Offset of field: rusage::ru_majflt"][::std::mem::offset_of!(rusage, ru_majflt) - 72usize];
    ["Offset of field: rusage::ru_nswap"][::std::mem::offset_of!(rusage, ru_nswap) - 80usize];
    ["Offset of field: rusage::ru_inblock"][::std::mem::offset_of!(rusage, ru_inblock) - 88usize];
    ["Offset of field: rusage::ru_oublock"][::std::mem::offset_of!(rusage, ru_oublock) - 96usize];
    ["Offset of field: rusage::ru_msgsnd"][::std::mem::offset_of!(rusage, ru_msgsnd) - 104usize];
    ["Offset of field: rusage::ru_msgrcv"][::std::mem::offset_of!(rusage, ru_msgrcv) - 112usize];
    ["Offset of field: rusage::ru_nsignals"]
        [::std::mem::offset_of!(rusage, ru_nsignals) - 120usize];
    ["Offset of field: rusage::ru_nvcsw"][::std::mem::offset_of!(rusage, ru_nvcsw) - 128usize];
    ["Offset of field: rusage::ru_nivcsw"][::std::mem::offset_of!(rusage, ru_nivcsw) - 136usize];
};
pub type rusage_info_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v0 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v0"][::std::mem::size_of::<rusage_info_v0>() - 96usize];
    ["Alignment of rusage_info_v0"][::std::mem::align_of::<rusage_info_v0>() - 8usize];
    ["Offset of field: rusage_info_v0::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v0, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v0::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v0::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v0::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v0::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v0::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v0::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v0::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v0::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v0, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v0::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v0::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_exit_abstime) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v1 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v1"][::std::mem::size_of::<rusage_info_v1>() - 144usize];
    ["Alignment of rusage_info_v1"][::std::mem::align_of::<rusage_info_v1>() - 8usize];
    ["Offset of field: rusage_info_v1::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v1, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v1::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v1::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v1::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v1::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v1::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v1::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v1::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v1::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v1, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v1::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v1::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v1::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v1::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v1::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v1::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v1::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v1::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_elapsed_abstime) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v2 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v2"][::std::mem::size_of::<rusage_info_v2>() - 160usize];
    ["Alignment of rusage_info_v2"][::std::mem::align_of::<rusage_info_v2>() - 8usize];
    ["Offset of field: rusage_info_v2::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v2, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v2::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v2::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v2::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v2::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v2::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v2::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v2::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v2::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v2, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v2::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v2::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v2::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v2::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v2::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v2::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v2::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v2::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v2::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v2::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_byteswritten) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v3 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v3"][::std::mem::size_of::<rusage_info_v3>() - 232usize];
    ["Alignment of rusage_info_v3"][::std::mem::align_of::<rusage_info_v3>() - 8usize];
    ["Offset of field: rusage_info_v3::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v3, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v3::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v3::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v3::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v3::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v3::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v3::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v3::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v3::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v3, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v3::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v3::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v3::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v3::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v3::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v3::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v3::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v3::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v3::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v3::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v3::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v3::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_serviced_system_time) - 224usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v4 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v4"][::std::mem::size_of::<rusage_info_v4>() - 296usize];
    ["Alignment of rusage_info_v4"][::std::mem::align_of::<rusage_info_v4>() - 8usize];
    ["Offset of field: rusage_info_v4::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v4, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v4::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v4::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v4::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v4::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v4::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v4::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v4::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v4::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v4::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v4::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v4::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v4::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v4::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v4::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v4::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v4::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v4::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v4::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v4::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v4::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v4::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v4, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v4::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v4::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v4, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v4::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v4::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v4::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v4::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v4::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_runnable_time) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v5 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v5"][::std::mem::size_of::<rusage_info_v5>() - 304usize];
    ["Alignment of rusage_info_v5"][::std::mem::align_of::<rusage_info_v5>() - 8usize];
    ["Offset of field: rusage_info_v5::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v5, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v5::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v5::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v5::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v5::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v5::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v5::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v5::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v5::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v5::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v5::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v5::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v5::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v5::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v5::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v5::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v5::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v5::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v5::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v5::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v5::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v5::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v5, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v5::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v5::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v5, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v5::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v5::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v5::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v5::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v5::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v5::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v5, ri_flags) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v6 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
    pub ri_user_ptime: u64,
    pub ri_system_ptime: u64,
    pub ri_pinstructions: u64,
    pub ri_pcycles: u64,
    pub ri_energy_nj: u64,
    pub ri_penergy_nj: u64,
    pub ri_secure_time_in_system: u64,
    pub ri_secure_ptime_in_system: u64,
    pub ri_reserved: [u64; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v6"][::std::mem::size_of::<rusage_info_v6>() - 464usize];
    ["Alignment of rusage_info_v6"][::std::mem::align_of::<rusage_info_v6>() - 8usize];
    ["Offset of field: rusage_info_v6::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v6, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v6::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v6::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v6::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v6::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v6::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v6::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v6::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v6::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v6::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v6::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v6::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v6::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v6::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v6::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v6::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v6::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v6::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v6::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v6::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v6::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v6::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v6, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v6::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v6::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v6::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v6::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v6::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v6::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v6::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v6::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v6, ri_flags) - 296usize];
    ["Offset of field: rusage_info_v6::ri_user_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_ptime) - 304usize];
    ["Offset of field: rusage_info_v6::ri_system_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_ptime) - 312usize];
    ["Offset of field: rusage_info_v6::ri_pinstructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pinstructions) - 320usize];
    ["Offset of field: rusage_info_v6::ri_pcycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pcycles) - 328usize];
    ["Offset of field: rusage_info_v6::ri_energy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_energy_nj) - 336usize];
    ["Offset of field: rusage_info_v6::ri_penergy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_penergy_nj) - 344usize];
    ["Offset of field: rusage_info_v6::ri_secure_time_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_time_in_system) - 352usize];
    ["Offset of field: rusage_info_v6::ri_secure_ptime_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_ptime_in_system) - 360usize];
    ["Offset of field: rusage_info_v6::ri_reserved"]
        [::std::mem::offset_of!(rusage_info_v6, ri_reserved) - 368usize];
};
pub type rusage_info_current = rusage_info_v6;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlimit {
    pub rlim_cur: rlim_t,
    pub rlim_max: rlim_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlimit"][::std::mem::size_of::<rlimit>() - 16usize];
    ["Alignment of rlimit"][::std::mem::align_of::<rlimit>() - 8usize];
    ["Offset of field: rlimit::rlim_cur"][::std::mem::offset_of!(rlimit, rlim_cur) - 0usize];
    ["Offset of field: rlimit::rlim_max"][::std::mem::offset_of!(rlimit, rlim_max) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_rlimit_control_wakeupmon {
    pub wm_flags: u32,
    pub wm_rate: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of proc_rlimit_control_wakeupmon"]
        [::std::mem::size_of::<proc_rlimit_control_wakeupmon>() - 8usize];
    ["Alignment of proc_rlimit_control_wakeupmon"]
        [::std::mem::align_of::<proc_rlimit_control_wakeupmon>() - 4usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_flags"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_flags) - 0usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_rate"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_rate) - 4usize];
};
unsafe extern "C" {
    pub fn getpriority(arg1: ::std::os::raw::c_int, arg2: id_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrlimit(arg1: ::std::os::raw::c_int, arg2: *mut rlimit) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrusage(arg1: ::std::os::raw::c_int, arg2: *mut rusage) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setpriority(
        arg1: ::std::os::raw::c_int,
        arg2: id_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setrlimit(arg1: ::std::os::raw::c_int, arg2: *const rlimit) -> ::std::os::raw::c_int;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU16 {
    pub __val: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU16"][::std::mem::size_of::<_OSUnalignedU16>() - 2usize];
    ["Alignment of _OSUnalignedU16"][::std::mem::align_of::<_OSUnalignedU16>() - 1usize];
    ["Offset of field: _OSUnalignedU16::__val"]
        [::std::mem::offset_of!(_OSUnalignedU16, __val) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU32 {
    pub __val: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU32"][::std::mem::size_of::<_OSUnalignedU32>() - 4usize];
    ["Alignment of _OSUnalignedU32"][::std::mem::align_of::<_OSUnalignedU32>() - 1usize];
    ["Offset of field: _OSUnalignedU32::__val"]
        [::std::mem::offset_of!(_OSUnalignedU32, __val) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU64 {
    pub __val: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU64"][::std::mem::size_of::<_OSUnalignedU64>() - 8usize];
    ["Alignment of _OSUnalignedU64"][::std::mem::align_of::<_OSUnalignedU64>() - 1usize];
    ["Offset of field: _OSUnalignedU64::__val"]
        [::std::mem::offset_of!(_OSUnalignedU64, __val) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
    pub w_status: ::std::os::raw::c_int,
    pub w_T: wait__bindgen_ty_1,
    pub w_S: wait__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_1"][::std::mem::size_of::<wait__bindgen_ty_1>() - 4usize];
    ["Alignment of wait__bindgen_ty_1"][::std::mem::align_of::<wait__bindgen_ty_1>() - 4usize];
};
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn w_Termsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_w_Termsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Termsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                7u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Termsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Coredump(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_w_Coredump(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Coredump_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Coredump_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Retcode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Retcode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Retcode_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Retcode_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Termsig: ::std::os::raw::c_uint,
        w_Coredump: ::std::os::raw::c_uint,
        w_Retcode: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let w_Termsig: u32 = unsafe { ::std::mem::transmute(w_Termsig) };
            w_Termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let w_Coredump: u32 = unsafe { ::std::mem::transmute(w_Coredump) };
            w_Coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Retcode: u32 = unsafe { ::std::mem::transmute(w_Retcode) };
            w_Retcode as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_2"][::std::mem::size_of::<wait__bindgen_ty_2>() - 4usize];
    ["Alignment of wait__bindgen_ty_2"][::std::mem::align_of::<wait__bindgen_ty_2>() - 4usize];
};
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn w_Stopval(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopval(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopval_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopval_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Stopsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Stopval: ::std::os::raw::c_uint,
        w_Stopsig: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let w_Stopval: u32 = unsafe { ::std::mem::transmute(w_Stopval) };
            w_Stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Stopsig: u32 = unsafe { ::std::mem::transmute(w_Stopsig) };
            w_Stopsig as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait"][::std::mem::size_of::<wait>() - 4usize];
    ["Alignment of wait"][::std::mem::align_of::<wait>() - 4usize];
    ["Offset of field: wait::w_status"][::std::mem::offset_of!(wait, w_status) - 0usize];
    ["Offset of field: wait::w_T"][::std::mem::offset_of!(wait, w_T) - 0usize];
    ["Offset of field: wait::w_S"][::std::mem::offset_of!(wait, w_S) - 0usize];
};
unsafe extern "C" {
    pub fn wait(arg1: *mut ::std::os::raw::c_int) -> pid_t;
}
unsafe extern "C" {
    pub fn waitpid(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn waitid(
        arg1: idtype_t,
        arg2: id_t,
        arg3: *mut siginfo_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wait3(
        arg1: *mut ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn wait4(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn alloca(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
pub type ct_rune_t = __darwin_ct_rune_t;
pub type rune_t = __darwin_rune_t;
pub type wchar_t = __darwin_wchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub static mut __mb_cur_max: ::std::os::raw::c_int;
}
pub type malloc_type_id_t = ::std::os::raw::c_ulonglong;
unsafe extern "C" {
    pub fn malloc_type_malloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_calloc(
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_free(ptr: *mut ::std::os::raw::c_void, type_id: malloc_type_id_t);
}
unsafe extern "C" {
    pub fn malloc_type_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_valloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_aligned_alloc(
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_posix_memalign(
        memptr: *mut *mut ::std::os::raw::c_void,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _malloc_zone_t {
    _unused: [u8; 0],
}
pub type malloc_zone_t = _malloc_zone_t;
unsafe extern "C" {
    pub fn malloc_type_zone_malloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_calloc(
        zone: *mut malloc_zone_t,
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_free(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        type_id: malloc_type_id_t,
    );
}
unsafe extern "C" {
    pub fn malloc_type_zone_realloc(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_valloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_memalign(
        zone: *mut malloc_zone_t,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __count: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn reallocf(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(arg1: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atof(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn div(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ldiv(arg1: ::std::os::raw::c_long, arg2: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lldiv(arg1: ::std::os::raw::c_longlong, arg2: ::std::os::raw::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn strtod(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtol(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtoll(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoul(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoull(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn system(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn a64l(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn ecvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn fcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn grantpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn l64a(arg1: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn posix_openpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ptsname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ptsname_r(
        fildes: ::std::os::raw::c_int,
        buffer: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putenv(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rand_r(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}_realpath$DARWIN_EXTSN"]
    pub fn realpath(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setstate(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn unlockpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
pub type dev_t = __darwin_dev_t;
pub type mode_t = __darwin_mode_t;
unsafe extern "C" {
    pub fn arc4random() -> u32;
}
unsafe extern "C" {
    pub fn arc4random_addrandom(arg1: *mut ::std::os::raw::c_uchar, arg2: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __nbytes: usize);
}
unsafe extern "C" {
    pub fn arc4random_stir();
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: u32) -> u32;
}
unsafe extern "C" {
    pub fn atexit_b(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bsearch_b(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn cgetcap(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cgetclose() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetent(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetfirst(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetmatch(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnext(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnum(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetset(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetstr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetustr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn daemon(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn devname(arg1: dev_t, arg2: mode_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn devname_r(
        arg1: dev_t,
        arg2: mode_t,
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getbsize(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getloadavg(arg1: *mut f64, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getprogname() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setprogname(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn heapsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn heapsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn psort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn psort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn psort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn qsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn radixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rpmatch(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sradixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sranddev();
}
unsafe extern "C" {
    pub fn srandomdev();
}
unsafe extern "C" {
    pub fn strtonum(
        __numstr: *const ::std::os::raw::c_char,
        __minval: ::std::os::raw::c_longlong,
        __maxval: ::std::os::raw::c_longlong,
        __errstrp: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub static mut suboptarg: *mut ::std::os::raw::c_char;
}
pub type rsize_t = ::std::os::raw::c_ulong;
pub type max_align_t = f64;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_quad_t = u_int64_t;
pub type quad_t = i64;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type daddr_t = i32;
pub type fixpt_t = u_int32_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type ino_t = __darwin_ino_t;
pub type ino64_t = __darwin_ino64_t;
pub type key_t = __int32_t;
pub type nlink_t = __uint16_t;
pub type off_t = __darwin_off_t;
pub type segsz_t = i32;
pub type swblk_t = i32;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
pub type useconds_t = __darwin_useconds_t;
pub type suseconds_t = __darwin_suseconds_t;
pub type errno_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__int32_t; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::fds_bits"][::std::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
unsafe extern "C" {
    pub fn __darwin_check_fd_set_overflow(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type fd_mask = __int32_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type fsblkcnt_t = __darwin_fsblkcnt_t;
pub type fsfilcnt_t = __darwin_fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct objc_class {
    _unused: [u8; 0],
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct Class(pub id);
impl std::ops::Deref for Class {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for Class {}
impl Class {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(Class), alloc) })
    }
}
impl IClass for Class {}
pub trait IClass: Sized + std::ops::Deref {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct objc_selector {
    _unused: [u8; 0],
}
pub type IMP = ::std::option::Option<unsafe extern "C" fn()>;
pub type BOOL = bool;
pub type objc_zone_t = *mut _malloc_zone_t;
unsafe extern "C" {
    pub fn sel_getName(sel: objc::runtime::Sel) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn sel_registerName(str_: *const ::std::os::raw::c_char) -> objc::runtime::Sel;
}
unsafe extern "C" {
    pub fn object_getClassName(obj: id) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn object_getIndexedIvars(obj: id) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn sel_isMapped(sel: objc::runtime::Sel) -> BOOL;
}
unsafe extern "C" {
    pub fn sel_getUid(str_: *const ::std::os::raw::c_char) -> objc::runtime::Sel;
}
pub type objc_objectptr_t = *const ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn objc_retainedObject(obj: objc_objectptr_t) -> id;
}
unsafe extern "C" {
    pub fn objc_unretainedObject(obj: objc_objectptr_t) -> id;
}
unsafe extern "C" {
    pub fn objc_unretainedPointer(obj: id) -> objc_objectptr_t;
}
pub type NSInteger = ::std::os::raw::c_long;
pub type NSUInteger = ::std::os::raw::c_ulong;
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSMethodSignature(pub id);
impl std::ops::Deref for NSMethodSignature {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSMethodSignature {}
impl NSMethodSignature {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSMethodSignature), alloc) })
    }
}
impl INSMethodSignature for NSMethodSignature {}
pub trait INSMethodSignature: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSInvocation(pub id);
impl std::ops::Deref for NSInvocation {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSInvocation {}
impl NSInvocation {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSInvocation), alloc) })
    }
}
impl INSInvocation for NSInvocation {}
pub trait INSInvocation: Sized + std::ops::Deref {}
pub trait PNSObject: Sized + std::ops::Deref {
    unsafe fn isEqual_(&self, object: id) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqual : object) }
    }
    unsafe fn class(&self) -> Class
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, class) }
    }
    unsafe fn self_(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, self_) }
    }
    unsafe fn performSelector_(&self, aSelector: objc::runtime::Sel) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , performSelector : aSelector) }
    }
    unsafe fn performSelector_withObject_(&self, aSelector: objc::runtime::Sel, object: id) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , performSelector : aSelector withObject : object) }
    }
    unsafe fn performSelector_withObject_withObject_(
        &self,
        aSelector: objc::runtime::Sel,
        object1: id,
        object2: id,
    ) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , performSelector : aSelector withObject : object1 withObject : object2)
        }
    }
    unsafe fn isProxy(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, isProxy) }
    }
    unsafe fn isKindOfClass_(&self, aClass: Class) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isKindOfClass : aClass) }
    }
    unsafe fn isMemberOfClass_(&self, aClass: Class) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isMemberOfClass : aClass) }
    }
    unsafe fn conformsToProtocol_(&self, aProtocol: Protocol) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , conformsToProtocol : aProtocol) }
    }
    unsafe fn respondsToSelector_(&self, aSelector: objc::runtime::Sel) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , respondsToSelector : aSelector) }
    }
    unsafe fn retain(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, retain) }
    }
    unsafe fn release(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, release) }
    }
    unsafe fn autorelease(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, autorelease) }
    }
    unsafe fn retainCount(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, retainCount) }
    }
    unsafe fn zone(&self) -> *mut _NSZone
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, zone) }
    }
    unsafe fn hash(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, hash) }
    }
    unsafe fn superclass(&self) -> Class
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, superclass) }
    }
    unsafe fn description(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, description) }
    }
    unsafe fn debugDescription(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, debugDescription) }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NSZone {
    _unused: [u8; 0],
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSObject(pub id);
impl std::ops::Deref for NSObject {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSObject {}
impl NSObject {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSObject), alloc) })
    }
}
impl PNSObject for NSObject {}
impl INSObject for NSObject {}
pub trait INSObject: Sized + std::ops::Deref {
    unsafe fn init(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn dealloc(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, dealloc) }
    }
    unsafe fn finalize(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, finalize) }
    }
    unsafe fn copy(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, copy) }
    }
    unsafe fn mutableCopy(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, mutableCopy) }
    }
    unsafe fn methodForSelector_(&self, aSelector: objc::runtime::Sel) -> IMP
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , methodForSelector : aSelector) }
    }
    unsafe fn doesNotRecognizeSelector_(&self, aSelector: objc::runtime::Sel)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , doesNotRecognizeSelector : aSelector) }
    }
    unsafe fn forwardingTargetForSelector_(&self, aSelector: objc::runtime::Sel) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , forwardingTargetForSelector : aSelector) }
    }
    unsafe fn forwardInvocation_(&self, anInvocation: NSInvocation)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , forwardInvocation : anInvocation) }
    }
    unsafe fn methodSignatureForSelector_(&self, aSelector: objc::runtime::Sel) -> NSMethodSignature
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , methodSignatureForSelector : aSelector) }
    }
    unsafe fn allowsWeakReference(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allowsWeakReference) }
    }
    unsafe fn retainWeakReference(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, retainWeakReference) }
    }
    unsafe fn load()
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), load) }
    }
    unsafe fn initialize()
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), initialize) }
    }
    unsafe fn new() -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), new) }
    }
    unsafe fn allocWithZone_(zone: *mut _NSZone) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , allocWithZone : zone) }
    }
    unsafe fn alloc() -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), alloc) }
    }
    unsafe fn copyWithZone_(zone: *mut _NSZone) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , copyWithZone : zone) }
    }
    unsafe fn mutableCopyWithZone_(zone: *mut _NSZone) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , mutableCopyWithZone : zone) }
    }
    unsafe fn instancesRespondToSelector_(aSelector: objc::runtime::Sel) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , instancesRespondToSelector : aSelector) }
    }
    unsafe fn conformsToProtocol_(protocol: Protocol) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , conformsToProtocol : protocol) }
    }
    unsafe fn instanceMethodForSelector_(aSelector: objc::runtime::Sel) -> IMP
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , instanceMethodForSelector : aSelector) }
    }
    unsafe fn instanceMethodSignatureForSelector_(
        aSelector: objc::runtime::Sel,
    ) -> NSMethodSignature
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , instanceMethodSignatureForSelector : aSelector) }
    }
    unsafe fn isSubclassOfClass_(aClass: Class) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , isSubclassOfClass : aClass) }
    }
    unsafe fn resolveClassMethod_(sel: objc::runtime::Sel) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , resolveClassMethod : sel) }
    }
    unsafe fn resolveInstanceMethod_(sel: objc::runtime::Sel) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , resolveInstanceMethod : sel) }
    }
    unsafe fn hash() -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), hash) }
    }
    unsafe fn superclass() -> Class
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), superclass) }
    }
    unsafe fn class() -> Class
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), class) }
    }
    unsafe fn description() -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), description) }
    }
    unsafe fn debugDescription() -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), debugDescription) }
    }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
unsafe extern "C" {
    pub static mut NSFoundationVersionNumber: f64;
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct Protocol(pub id);
impl std::ops::Deref for Protocol {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for Protocol {}
impl Protocol {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(Protocol), alloc) })
    }
}
impl IProtocol for Protocol {}
pub trait IProtocol: Sized + std::ops::Deref {}
pub type NSExceptionName = NSString;
pub type NSRunLoopMode = NSString;
unsafe extern "C" {
    pub fn NSStringFromSelector(aSelector: objc::runtime::Sel) -> NSString;
}
unsafe extern "C" {
    pub fn NSSelectorFromString(aSelectorName: NSString) -> objc::runtime::Sel;
}
unsafe extern "C" {
    pub fn NSStringFromClass(aClass: Class) -> NSString;
}
unsafe extern "C" {
    pub fn NSClassFromString(aClassName: NSString) -> Class;
}
unsafe extern "C" {
    pub fn NSStringFromProtocol(proto: Protocol) -> NSString;
}
unsafe extern "C" {
    pub fn NSProtocolFromString(namestr: NSString) -> Protocol;
}
unsafe extern "C" {
    pub fn NSGetSizeAndAlignment(
        typePtr: *const ::std::os::raw::c_char,
        sizep: *mut NSUInteger,
        alignp: *mut NSUInteger,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn NSLog(format: id, ...);
}
unsafe extern "C" {
    pub fn NSLogv(format: id, args: __builtin_va_list);
}
pub const NSComparisonResult_NSOrderedAscending: NSComparisonResult = -1;
pub const NSComparisonResult_NSOrderedSame: NSComparisonResult = 0;
pub const NSComparisonResult_NSOrderedDescending: NSComparisonResult = 1;
pub type NSComparisonResult = NSInteger;
pub type NSComparator = *mut ::std::os::raw::c_void;
pub const NSEnumerationOptions_NSEnumerationConcurrent: NSEnumerationOptions = 1;
pub const NSEnumerationOptions_NSEnumerationReverse: NSEnumerationOptions = 2;
pub type NSEnumerationOptions = NSUInteger;
pub const NSSortOptions_NSSortConcurrent: NSSortOptions = 1;
pub const NSSortOptions_NSSortStable: NSSortOptions = 16;
pub type NSSortOptions = NSUInteger;
pub const NSQualityOfService_NSQualityOfServiceUserInteractive: NSQualityOfService = 33;
pub const NSQualityOfService_NSQualityOfServiceUserInitiated: NSQualityOfService = 25;
pub const NSQualityOfService_NSQualityOfServiceUtility: NSQualityOfService = 17;
pub const NSQualityOfService_NSQualityOfServiceBackground: NSQualityOfService = 9;
pub const NSQualityOfService_NSQualityOfServiceDefault: NSQualityOfService = -1;
pub type NSQualityOfService = NSInteger;
pub const NSNotFound: NSInteger = 9223372036854775807;
pub const ptrauth_key_ptrauth_key_none: ptrauth_key = -1;
pub const ptrauth_key_ptrauth_key_asia: ptrauth_key = 0;
pub const ptrauth_key_ptrauth_key_asib: ptrauth_key = 1;
pub const ptrauth_key_ptrauth_key_asda: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_asdb: ptrauth_key = 3;
pub const ptrauth_key_ptrauth_key_process_independent_code: ptrauth_key = 0;
pub const ptrauth_key_ptrauth_key_process_dependent_code: ptrauth_key = 1;
pub const ptrauth_key_ptrauth_key_process_independent_data: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_process_dependent_data: ptrauth_key = 3;
pub const ptrauth_key_ptrauth_key_function_pointer: ptrauth_key = 0;
pub const ptrauth_key_ptrauth_key_return_address: ptrauth_key = 1;
pub const ptrauth_key_ptrauth_key_frame_pointer: ptrauth_key = 3;
pub const ptrauth_key_ptrauth_key_block_function: ptrauth_key = 0;
pub const ptrauth_key_ptrauth_key_cxx_vtable_pointer: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_method_list_pointer: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_objc_isa_pointer: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_objc_super_pointer: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_block_descriptor_pointer: ptrauth_key = 2;
pub const ptrauth_key_ptrauth_key_objc_sel_pointer: ptrauth_key = 3;
pub const ptrauth_key_ptrauth_key_objc_class_ro_pointer: ptrauth_key = 2;
pub type ptrauth_key = ::std::os::raw::c_int;
pub type ptrauth_extra_data_t = ::std::os::raw::c_ulong;
pub type ptrauth_generic_signature_t = ::std::os::raw::c_ulong;
unsafe extern "C" {
    pub fn _Block_copy(aBlock: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _Block_release(aBlock: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _Block_object_assign(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn _Block_object_dispose(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub static mut _NSConcreteGlobalBlock: [*mut ::std::os::raw::c_void; 32usize];
}
unsafe extern "C" {
    pub static mut _NSConcreteStackBlock: [*mut ::std::os::raw::c_void; 32usize];
}
pub type UInt8 = ::std::os::raw::c_uchar;
pub type SInt8 = ::std::os::raw::c_schar;
pub type UInt16 = ::std::os::raw::c_ushort;
pub type SInt16 = ::std::os::raw::c_short;
pub type UInt32 = ::std::os::raw::c_uint;
pub type SInt32 = ::std::os::raw::c_int;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct wide {
    pub lo: UInt32,
    pub hi: SInt32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wide"][::std::mem::size_of::<wide>() - 8usize];
    ["Alignment of wide"][::std::mem::align_of::<wide>() - 2usize];
    ["Offset of field: wide::lo"][::std::mem::offset_of!(wide, lo) - 0usize];
    ["Offset of field: wide::hi"][::std::mem::offset_of!(wide, hi) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct UnsignedWide {
    pub lo: UInt32,
    pub hi: UInt32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UnsignedWide"][::std::mem::size_of::<UnsignedWide>() - 8usize];
    ["Alignment of UnsignedWide"][::std::mem::align_of::<UnsignedWide>() - 2usize];
    ["Offset of field: UnsignedWide::lo"][::std::mem::offset_of!(UnsignedWide, lo) - 0usize];
    ["Offset of field: UnsignedWide::hi"][::std::mem::offset_of!(UnsignedWide, hi) - 4usize];
};
pub type SInt64 = ::std::os::raw::c_longlong;
pub type UInt64 = ::std::os::raw::c_ulonglong;
pub type Fixed = SInt32;
pub type FixedPtr = *mut Fixed;
pub type Fract = SInt32;
pub type FractPtr = *mut Fract;
pub type UnsignedFixed = UInt32;
pub type UnsignedFixedPtr = *mut UnsignedFixed;
pub type ShortFixed = ::std::os::raw::c_short;
pub type ShortFixedPtr = *mut ShortFixed;
pub type Float32 = f32;
pub type Float64 = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Float80 {
    pub exp: SInt16,
    pub man: [UInt16; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Float80"][::std::mem::size_of::<Float80>() - 10usize];
    ["Alignment of Float80"][::std::mem::align_of::<Float80>() - 2usize];
    ["Offset of field: Float80::exp"][::std::mem::offset_of!(Float80, exp) - 0usize];
    ["Offset of field: Float80::man"][::std::mem::offset_of!(Float80, man) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Float96 {
    pub exp: [SInt16; 2usize],
    pub man: [UInt16; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Float96"][::std::mem::size_of::<Float96>() - 12usize];
    ["Alignment of Float96"][::std::mem::align_of::<Float96>() - 2usize];
    ["Offset of field: Float96::exp"][::std::mem::offset_of!(Float96, exp) - 0usize];
    ["Offset of field: Float96::man"][::std::mem::offset_of!(Float96, man) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Float32Point {
    pub x: Float32,
    pub y: Float32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Float32Point"][::std::mem::size_of::<Float32Point>() - 8usize];
    ["Alignment of Float32Point"][::std::mem::align_of::<Float32Point>() - 2usize];
    ["Offset of field: Float32Point::x"][::std::mem::offset_of!(Float32Point, x) - 0usize];
    ["Offset of field: Float32Point::y"][::std::mem::offset_of!(Float32Point, y) - 4usize];
};
pub type Ptr = *mut ::std::os::raw::c_char;
pub type Handle = *mut Ptr;
pub type Size = ::std::os::raw::c_long;
pub type OSErr = SInt16;
pub type OSStatus = SInt32;
pub type LogicalAddress = *mut ::std::os::raw::c_void;
pub type ConstLogicalAddress = *const ::std::os::raw::c_void;
pub type PhysicalAddress = *mut ::std::os::raw::c_void;
pub type BytePtr = *mut UInt8;
pub type ByteCount = ::std::os::raw::c_ulong;
pub type ByteOffset = ::std::os::raw::c_ulong;
pub type Duration = SInt32;
pub type AbsoluteTime = UnsignedWide;
pub type OptionBits = UInt32;
pub type ItemCount = ::std::os::raw::c_ulong;
pub type PBVersion = UInt32;
pub type ScriptCode = SInt16;
pub type LangCode = SInt16;
pub type RegionCode = SInt16;
pub type FourCharCode = UInt32;
pub type OSType = FourCharCode;
pub type ResType = FourCharCode;
pub type OSTypePtr = *mut OSType;
pub type ResTypePtr = *mut ResType;
pub type Boolean = ::std::os::raw::c_uchar;
pub type ProcPtr = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_long>;
pub type Register68kProcPtr = ::std::option::Option<unsafe extern "C" fn()>;
pub type UniversalProcPtr = ProcPtr;
pub type ProcHandle = *mut ProcPtr;
pub type UniversalProcHandle = *mut UniversalProcPtr;
pub type PRefCon = *mut ::std::os::raw::c_void;
pub type URefCon = *mut ::std::os::raw::c_void;
pub type SRefCon = *mut ::std::os::raw::c_void;
pub const noErr: _bindgen_ty_1 = 0;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const kNilOptions: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const kVariableLengthArray: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const kUnknownType: _bindgen_ty_4 = 1061109567;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub type UnicodeScalarValue = UInt32;
pub type UTF32Char = UInt32;
pub type UniChar = UInt16;
pub type UTF16Char = UInt16;
pub type UTF8Char = UInt8;
pub type UniCharPtr = *mut UniChar;
pub type UniCharCount = ::std::os::raw::c_ulong;
pub type UniCharCountPtr = *mut UniCharCount;
pub type Str255 = [::std::os::raw::c_uchar; 256usize];
pub type Str63 = [::std::os::raw::c_uchar; 64usize];
pub type Str32 = [::std::os::raw::c_uchar; 33usize];
pub type Str31 = [::std::os::raw::c_uchar; 32usize];
pub type Str27 = [::std::os::raw::c_uchar; 28usize];
pub type Str15 = [::std::os::raw::c_uchar; 16usize];
pub type Str32Field = [::std::os::raw::c_uchar; 34usize];
pub type StrFileName = Str63;
pub type StringPtr = *mut ::std::os::raw::c_uchar;
pub type StringHandle = *mut StringPtr;
pub type ConstStringPtr = *const ::std::os::raw::c_uchar;
pub type ConstStr255Param = *const ::std::os::raw::c_uchar;
pub type ConstStr63Param = *const ::std::os::raw::c_uchar;
pub type ConstStr32Param = *const ::std::os::raw::c_uchar;
pub type ConstStr31Param = *const ::std::os::raw::c_uchar;
pub type ConstStr27Param = *const ::std::os::raw::c_uchar;
pub type ConstStr15Param = *const ::std::os::raw::c_uchar;
pub type ConstStrFileNameParam = ConstStr63Param;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ProcessSerialNumber {
    pub highLongOfPSN: UInt32,
    pub lowLongOfPSN: UInt32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProcessSerialNumber"][::std::mem::size_of::<ProcessSerialNumber>() - 8usize];
    ["Alignment of ProcessSerialNumber"][::std::mem::align_of::<ProcessSerialNumber>() - 2usize];
    ["Offset of field: ProcessSerialNumber::highLongOfPSN"]
        [::std::mem::offset_of!(ProcessSerialNumber, highLongOfPSN) - 0usize];
    ["Offset of field: ProcessSerialNumber::lowLongOfPSN"]
        [::std::mem::offset_of!(ProcessSerialNumber, lowLongOfPSN) - 4usize];
};
pub type ProcessSerialNumberPtr = *mut ProcessSerialNumber;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Point {
    pub v: ::std::os::raw::c_short,
    pub h: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Point"][::std::mem::size_of::<Point>() - 4usize];
    ["Alignment of Point"][::std::mem::align_of::<Point>() - 2usize];
    ["Offset of field: Point::v"][::std::mem::offset_of!(Point, v) - 0usize];
    ["Offset of field: Point::h"][::std::mem::offset_of!(Point, h) - 2usize];
};
pub type PointPtr = *mut Point;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Rect {
    pub top: ::std::os::raw::c_short,
    pub left: ::std::os::raw::c_short,
    pub bottom: ::std::os::raw::c_short,
    pub right: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rect"][::std::mem::size_of::<Rect>() - 8usize];
    ["Alignment of Rect"][::std::mem::align_of::<Rect>() - 2usize];
    ["Offset of field: Rect::top"][::std::mem::offset_of!(Rect, top) - 0usize];
    ["Offset of field: Rect::left"][::std::mem::offset_of!(Rect, left) - 2usize];
    ["Offset of field: Rect::bottom"][::std::mem::offset_of!(Rect, bottom) - 4usize];
    ["Offset of field: Rect::right"][::std::mem::offset_of!(Rect, right) - 6usize];
};
pub type RectPtr = *mut Rect;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct FixedPoint {
    pub x: Fixed,
    pub y: Fixed,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FixedPoint"][::std::mem::size_of::<FixedPoint>() - 8usize];
    ["Alignment of FixedPoint"][::std::mem::align_of::<FixedPoint>() - 2usize];
    ["Offset of field: FixedPoint::x"][::std::mem::offset_of!(FixedPoint, x) - 0usize];
    ["Offset of field: FixedPoint::y"][::std::mem::offset_of!(FixedPoint, y) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct FixedRect {
    pub left: Fixed,
    pub top: Fixed,
    pub right: Fixed,
    pub bottom: Fixed,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FixedRect"][::std::mem::size_of::<FixedRect>() - 16usize];
    ["Alignment of FixedRect"][::std::mem::align_of::<FixedRect>() - 2usize];
    ["Offset of field: FixedRect::left"][::std::mem::offset_of!(FixedRect, left) - 0usize];
    ["Offset of field: FixedRect::top"][::std::mem::offset_of!(FixedRect, top) - 4usize];
    ["Offset of field: FixedRect::right"][::std::mem::offset_of!(FixedRect, right) - 8usize];
    ["Offset of field: FixedRect::bottom"][::std::mem::offset_of!(FixedRect, bottom) - 12usize];
};
pub type CharParameter = ::std::os::raw::c_short;
pub const normal: _bindgen_ty_5 = 0;
pub const bold: _bindgen_ty_5 = 1;
pub const italic: _bindgen_ty_5 = 2;
pub const underline: _bindgen_ty_5 = 4;
pub const outline: _bindgen_ty_5 = 8;
pub const shadow: _bindgen_ty_5 = 16;
pub const condense: _bindgen_ty_5 = 32;
pub const extend: _bindgen_ty_5 = 64;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type Style = ::std::os::raw::c_uchar;
pub type StyleParameter = ::std::os::raw::c_short;
pub type StyleField = Style;
pub type TimeValue = SInt32;
pub type TimeScale = SInt32;
pub type CompTimeValue = wide;
pub type TimeValue64 = SInt64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TimeBaseRecord {
    _unused: [u8; 0],
}
pub type TimeBase = *mut TimeBaseRecord;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TimeRecord {
    pub value: CompTimeValue,
    pub scale: TimeScale,
    pub base: TimeBase,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TimeRecord"][::std::mem::size_of::<TimeRecord>() - 20usize];
    ["Alignment of TimeRecord"][::std::mem::align_of::<TimeRecord>() - 2usize];
    ["Offset of field: TimeRecord::value"][::std::mem::offset_of!(TimeRecord, value) - 0usize];
    ["Offset of field: TimeRecord::scale"][::std::mem::offset_of!(TimeRecord, scale) - 8usize];
    ["Offset of field: TimeRecord::base"][::std::mem::offset_of!(TimeRecord, base) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NumVersion {
    pub nonRelRev: UInt8,
    pub stage: UInt8,
    pub minorAndBugRev: UInt8,
    pub majorRev: UInt8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NumVersion"][::std::mem::size_of::<NumVersion>() - 4usize];
    ["Alignment of NumVersion"][::std::mem::align_of::<NumVersion>() - 1usize];
    ["Offset of field: NumVersion::nonRelRev"]
        [::std::mem::offset_of!(NumVersion, nonRelRev) - 0usize];
    ["Offset of field: NumVersion::stage"][::std::mem::offset_of!(NumVersion, stage) - 1usize];
    ["Offset of field: NumVersion::minorAndBugRev"]
        [::std::mem::offset_of!(NumVersion, minorAndBugRev) - 2usize];
    ["Offset of field: NumVersion::majorRev"]
        [::std::mem::offset_of!(NumVersion, majorRev) - 3usize];
};
pub const developStage: _bindgen_ty_6 = 32;
pub const alphaStage: _bindgen_ty_6 = 64;
pub const betaStage: _bindgen_ty_6 = 96;
pub const finalStage: _bindgen_ty_6 = 128;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub union NumVersionVariant {
    pub parts: NumVersion,
    pub whole: UInt32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NumVersionVariant"][::std::mem::size_of::<NumVersionVariant>() - 4usize];
    ["Alignment of NumVersionVariant"][::std::mem::align_of::<NumVersionVariant>() - 2usize];
    ["Offset of field: NumVersionVariant::parts"]
        [::std::mem::offset_of!(NumVersionVariant, parts) - 0usize];
    ["Offset of field: NumVersionVariant::whole"]
        [::std::mem::offset_of!(NumVersionVariant, whole) - 0usize];
};
pub type NumVersionVariantPtr = *mut NumVersionVariant;
pub type NumVersionVariantHandle = *mut NumVersionVariantPtr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VersRec {
    pub numericVersion: NumVersion,
    pub countryCode: ::std::os::raw::c_short,
    pub shortVersion: Str255,
    pub reserved: Str255,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VersRec"][::std::mem::size_of::<VersRec>() - 518usize];
    ["Alignment of VersRec"][::std::mem::align_of::<VersRec>() - 2usize];
    ["Offset of field: VersRec::numericVersion"]
        [::std::mem::offset_of!(VersRec, numericVersion) - 0usize];
    ["Offset of field: VersRec::countryCode"]
        [::std::mem::offset_of!(VersRec, countryCode) - 4usize];
    ["Offset of field: VersRec::shortVersion"]
        [::std::mem::offset_of!(VersRec, shortVersion) - 6usize];
    ["Offset of field: VersRec::reserved"][::std::mem::offset_of!(VersRec, reserved) - 262usize];
};
pub type VersRecPtr = *mut VersRec;
pub type VersRecHndl = *mut VersRecPtr;
pub type Byte = UInt8;
pub type SignedByte = SInt8;
pub type WidePtr = *mut wide;
pub type UnsignedWidePtr = *mut UnsignedWide;
pub type extended80 = Float80;
pub type extended96 = Float96;
pub type VHSelect = SInt8;
unsafe extern "C" {
    pub fn Debugger();
}
unsafe extern "C" {
    pub fn DebugStr(debuggerMsg: ConstStr255Param);
}
unsafe extern "C" {
    pub fn SysBreak();
}
unsafe extern "C" {
    pub fn SysBreakStr(debuggerMsg: ConstStr255Param);
}
unsafe extern "C" {
    pub fn SysBreakFunc(debuggerMsg: ConstStr255Param);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSAttributedString(pub id);
impl std::ops::Deref for NSAttributedString {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSAttributedString {}
impl NSAttributedString {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSAttributedString), alloc) })
    }
}
impl INSAttributedString for NSAttributedString {}
pub trait INSAttributedString: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSNull(pub id);
impl std::ops::Deref for NSNull {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSNull {}
impl NSNull {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSNull), alloc) })
    }
}
impl INSNull for NSNull {}
pub trait INSNull: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSData(pub id);
impl std::ops::Deref for NSData {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSData {}
impl NSData {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSData), alloc) })
    }
}
impl INSData for NSData {}
pub trait INSData: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSDate(pub id);
impl std::ops::Deref for NSDate {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSDate {}
impl NSDate {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSDate), alloc) })
    }
}
impl INSDate for NSDate {}
pub trait INSDate: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSTimeZone(pub id);
impl std::ops::Deref for NSTimeZone {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSTimeZone {}
impl NSTimeZone {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSTimeZone), alloc) })
    }
}
impl INSTimeZone for NSTimeZone {}
pub trait INSTimeZone: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSLocale(pub id);
impl std::ops::Deref for NSLocale {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSLocale {}
impl NSLocale {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSLocale), alloc) })
    }
}
impl INSLocale for NSLocale {}
pub trait INSLocale: Sized + std::ops::Deref {}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSSet(pub id);
impl std::ops::Deref for NSSet {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSSet {}
impl NSSet {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSSet), alloc) })
    }
}
impl INSSet for NSSet {}
pub trait INSSet: Sized + std::ops::Deref {}
unsafe extern "C" {
    pub static mut kCFCoreFoundationVersionNumber: f64;
}
pub type CFTypeID = ::std::os::raw::c_ulong;
pub type CFOptionFlags = ::std::os::raw::c_ulong;
pub type CFHashCode = ::std::os::raw::c_ulong;
pub type CFIndex = ::std::os::raw::c_long;
pub type CFTypeRef = *const ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __CFString {
    _unused: [u8; 0],
}
pub type CFStringRef = *const __CFString;
pub type CFMutableStringRef = *mut __CFString;
pub type CFPropertyListRef = CFTypeRef;
pub const CFComparisonResult_kCFCompareLessThan: CFComparisonResult = -1;
pub const CFComparisonResult_kCFCompareEqualTo: CFComparisonResult = 0;
pub const CFComparisonResult_kCFCompareGreaterThan: CFComparisonResult = 1;
pub type CFComparisonResult = CFIndex;
pub type CFComparatorFunction = ::std::option::Option<
    unsafe extern "C" fn(
        val1: *const ::std::os::raw::c_void,
        val2: *const ::std::os::raw::c_void,
        context: *mut ::std::os::raw::c_void,
    ) -> CFComparisonResult,
>;
pub const kCFNotFound: CFIndex = -1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CFRange {
    pub location: CFIndex,
    pub length: CFIndex,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CFRange"][::std::mem::size_of::<CFRange>() - 16usize];
    ["Alignment of CFRange"][::std::mem::align_of::<CFRange>() - 8usize];
    ["Offset of field: CFRange::location"][::std::mem::offset_of!(CFRange, location) - 0usize];
    ["Offset of field: CFRange::length"][::std::mem::offset_of!(CFRange, length) - 8usize];
};
unsafe extern "C" {
    pub fn __CFRangeMake(loc: CFIndex, len: CFIndex) -> CFRange;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __CFNull {
    _unused: [u8; 0],
}
pub type CFNullRef = *const __CFNull;
unsafe extern "C" {
    pub fn CFNullGetTypeID() -> CFTypeID;
}
unsafe extern "C" {
    pub static kCFNull: CFNullRef;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __CFAllocator {
    _unused: [u8; 0],
}
pub type CFAllocatorRef = *const __CFAllocator;
unsafe extern "C" {
    pub static kCFAllocatorDefault: CFAllocatorRef;
}
unsafe extern "C" {
    pub static kCFAllocatorSystemDefault: CFAllocatorRef;
}
unsafe extern "C" {
    pub static kCFAllocatorMalloc: CFAllocatorRef;
}
unsafe extern "C" {
    pub static kCFAllocatorMallocZone: CFAllocatorRef;
}
unsafe extern "C" {
    pub static kCFAllocatorNull: CFAllocatorRef;
}
unsafe extern "C" {
    pub static kCFAllocatorUseContext: CFAllocatorRef;
}
pub type CFAllocatorRetainCallBack = ::std::option::Option<
    unsafe extern "C" fn(info: *const ::std::os::raw::c_void) -> *const ::std::os::raw::c_void,
>;
pub type CFAllocatorReleaseCallBack =
    ::std::option::Option<unsafe extern "C" fn(info: *const ::std::os::raw::c_void)>;
pub type CFAllocatorCopyDescriptionCallBack =
    ::std::option::Option<unsafe extern "C" fn(info: *const ::std::os::raw::c_void) -> CFStringRef>;
pub type CFAllocatorAllocateCallBack = ::std::option::Option<
    unsafe extern "C" fn(
        allocSize: CFIndex,
        hint: CFOptionFlags,
        info: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type CFAllocatorReallocateCallBack = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        newsize: CFIndex,
        hint: CFOptionFlags,
        info: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type CFAllocatorDeallocateCallBack = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, info: *mut ::std::os::raw::c_void),
>;
pub type CFAllocatorPreferredSizeCallBack = ::std::option::Option<
    unsafe extern "C" fn(
        size: CFIndex,
        hint: CFOptionFlags,
        info: *mut ::std::os::raw::c_void,
    ) -> CFIndex,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CFAllocatorContext {
    pub version: CFIndex,
    pub info: *mut ::std::os::raw::c_void,
    pub retain: CFAllocatorRetainCallBack,
    pub release: CFAllocatorReleaseCallBack,
    pub copyDescription: CFAllocatorCopyDescriptionCallBack,
    pub allocate: CFAllocatorAllocateCallBack,
    pub reallocate: CFAllocatorReallocateCallBack,
    pub deallocate: CFAllocatorDeallocateCallBack,
    pub preferredSize: CFAllocatorPreferredSizeCallBack,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CFAllocatorContext"][::std::mem::size_of::<CFAllocatorContext>() - 72usize];
    ["Alignment of CFAllocatorContext"][::std::mem::align_of::<CFAllocatorContext>() - 8usize];
    ["Offset of field: CFAllocatorContext::version"]
        [::std::mem::offset_of!(CFAllocatorContext, version) - 0usize];
    ["Offset of field: CFAllocatorContext::info"]
        [::std::mem::offset_of!(CFAllocatorContext, info) - 8usize];
    ["Offset of field: CFAllocatorContext::retain"]
        [::std::mem::offset_of!(CFAllocatorContext, retain) - 16usize];
    ["Offset of field: CFAllocatorContext::release"]
        [::std::mem::offset_of!(CFAllocatorContext, release) - 24usize];
    ["Offset of field: CFAllocatorContext::copyDescription"]
        [::std::mem::offset_of!(CFAllocatorContext, copyDescription) - 32usize];
    ["Offset of field: CFAllocatorContext::allocate"]
        [::std::mem::offset_of!(CFAllocatorContext, allocate) - 40usize];
    ["Offset of field: CFAllocatorContext::reallocate"]
        [::std::mem::offset_of!(CFAllocatorContext, reallocate) - 48usize];
    ["Offset of field: CFAllocatorContext::deallocate"]
        [::std::mem::offset_of!(CFAllocatorContext, deallocate) - 56usize];
    ["Offset of field: CFAllocatorContext::preferredSize"]
        [::std::mem::offset_of!(CFAllocatorContext, preferredSize) - 64usize];
};
unsafe extern "C" {
    pub fn CFAllocatorGetTypeID() -> CFTypeID;
}
unsafe extern "C" {
    pub fn CFAllocatorSetDefault(allocator: CFAllocatorRef);
}
unsafe extern "C" {
    pub fn CFAllocatorGetDefault() -> CFAllocatorRef;
}
unsafe extern "C" {
    pub fn CFAllocatorCreate(
        allocator: CFAllocatorRef,
        context: *mut CFAllocatorContext,
    ) -> CFAllocatorRef;
}
unsafe extern "C" {
    pub fn CFAllocatorAllocate(
        allocator: CFAllocatorRef,
        size: CFIndex,
        hint: CFOptionFlags,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CFAllocatorReallocate(
        allocator: CFAllocatorRef,
        ptr: *mut ::std::os::raw::c_void,
        newsize: CFIndex,
        hint: CFOptionFlags,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CFAllocatorDeallocate(allocator: CFAllocatorRef, ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn CFAllocatorGetPreferredSizeForSize(
        allocator: CFAllocatorRef,
        size: CFIndex,
        hint: CFOptionFlags,
    ) -> CFIndex;
}
unsafe extern "C" {
    pub fn CFAllocatorGetContext(allocator: CFAllocatorRef, context: *mut CFAllocatorContext);
}
unsafe extern "C" {
    pub fn CFGetTypeID(cf: CFTypeRef) -> CFTypeID;
}
unsafe extern "C" {
    pub fn CFCopyTypeIDDescription(type_id: CFTypeID) -> CFStringRef;
}
unsafe extern "C" {
    pub fn CFRetain(cf: CFTypeRef) -> CFTypeRef;
}
unsafe extern "C" {
    pub fn CFRelease(cf: CFTypeRef);
}
unsafe extern "C" {
    pub fn CFAutorelease(arg: CFTypeRef) -> CFTypeRef;
}
unsafe extern "C" {
    pub fn CFGetRetainCount(cf: CFTypeRef) -> CFIndex;
}
unsafe extern "C" {
    pub fn CFEqual(cf1: CFTypeRef, cf2: CFTypeRef) -> Boolean;
}
unsafe extern "C" {
    pub fn CFHash(cf: CFTypeRef) -> CFHashCode;
}
unsafe extern "C" {
    pub fn CFCopyDescription(cf: CFTypeRef) -> CFStringRef;
}
unsafe extern "C" {
    pub fn CFGetAllocator(cf: CFTypeRef) -> CFAllocatorRef;
}
unsafe extern "C" {
    pub fn CFMakeCollectable(cf: CFTypeRef) -> CFTypeRef;
}
pub type NSZone = _NSZone;
unsafe extern "C" {
    pub fn NSDefaultMallocZone() -> *mut NSZone;
}
unsafe extern "C" {
    pub fn NSCreateZone(
        startSize: NSUInteger,
        granularity: NSUInteger,
        canFree: BOOL,
    ) -> *mut NSZone;
}
unsafe extern "C" {
    pub fn NSRecycleZone(zone: *mut NSZone);
}
unsafe extern "C" {
    pub fn NSSetZoneName(zone: *mut NSZone, name: NSString);
}
unsafe extern "C" {
    pub fn NSZoneName(zone: *mut NSZone) -> NSString;
}
unsafe extern "C" {
    pub fn NSZoneFromPointer(ptr: *mut ::std::os::raw::c_void) -> *mut NSZone;
}
unsafe extern "C" {
    pub fn NSZoneMalloc(zone: *mut NSZone, size: NSUInteger) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSZoneCalloc(
        zone: *mut NSZone,
        numElems: NSUInteger,
        byteSize: NSUInteger,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSZoneRealloc(
        zone: *mut NSZone,
        ptr: *mut ::std::os::raw::c_void,
        size: NSUInteger,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSZoneFree(zone: *mut NSZone, ptr: *mut ::std::os::raw::c_void);
}
pub const NSScannedOption: _bindgen_ty_7 = 1;
pub const NSCollectorDisabledOption: _bindgen_ty_7 = 2;
pub type _bindgen_ty_7 = NSUInteger;
unsafe extern "C" {
    pub fn NSAllocateCollectable(
        size: NSUInteger,
        options: NSUInteger,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSReallocateCollectable(
        ptr: *mut ::std::os::raw::c_void,
        size: NSUInteger,
        options: NSUInteger,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSPageSize() -> NSUInteger;
}
unsafe extern "C" {
    pub fn NSLogPageSize() -> NSUInteger;
}
unsafe extern "C" {
    pub fn NSRoundUpToMultipleOfPageSize(bytes: NSUInteger) -> NSUInteger;
}
unsafe extern "C" {
    pub fn NSRoundDownToMultipleOfPageSize(bytes: NSUInteger) -> NSUInteger;
}
unsafe extern "C" {
    pub fn NSAllocateMemoryPages(bytes: NSUInteger) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn NSDeallocateMemoryPages(ptr: *mut ::std::os::raw::c_void, bytes: NSUInteger);
}
unsafe extern "C" {
    pub fn NSCopyMemoryPages(
        source: *const ::std::os::raw::c_void,
        dest: *mut ::std::os::raw::c_void,
        bytes: NSUInteger,
    );
}
unsafe extern "C" {
    pub fn NSRealMemoryAvailable() -> NSUInteger;
}
pub trait PNSCopying: Sized + std::ops::Deref {
    unsafe fn copyWithZone_(&self, zone: *mut NSZone) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , copyWithZone : zone) }
    }
}
pub trait PNSMutableCopying: Sized + std::ops::Deref {
    unsafe fn mutableCopyWithZone_(&self, zone: *mut NSZone) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , mutableCopyWithZone : zone) }
    }
}
pub trait PNSCoding: Sized + std::ops::Deref {
    unsafe fn encodeWithCoder_(&self, coder: NSCoder)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeWithCoder : coder) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
}
pub trait PNSSecureCoding: Sized + std::ops::Deref {
    unsafe fn supportsSecureCoding() -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSSecureCoding), supportsSecureCoding) }
    }
}
impl NSObject_NSCoderMethods for NSObject {}
pub trait NSObject_NSCoderMethods: Sized + std::ops::Deref {
    unsafe fn replacementObjectForCoder_(&self, coder: NSCoder) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , replacementObjectForCoder : coder) }
    }
    unsafe fn awakeAfterUsingCoder_(&self, coder: NSCoder) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , awakeAfterUsingCoder : coder) }
    }
    unsafe fn classForCoder(&self) -> Class
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, classForCoder) }
    }
    unsafe fn version() -> NSInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSObject), version) }
    }
    unsafe fn setVersion_(aVersion: NSInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , setVersion : aVersion) }
    }
}
impl NSObject_NSDeprecatedMethods for NSObject {}
pub trait NSObject_NSDeprecatedMethods: Sized + std::ops::Deref {
    unsafe fn poseAsClass_(aClass: Class)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSObject) , poseAsClass : aClass) }
    }
}
pub trait PNSDiscardableContent: Sized + std::ops::Deref {
    unsafe fn beginContentAccess(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, beginContentAccess) }
    }
    unsafe fn endContentAccess(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, endContentAccess) }
    }
    unsafe fn discardContentIfPossible(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, discardContentIfPossible) }
    }
    unsafe fn isContentDiscarded(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, isContentDiscarded) }
    }
}
impl NSObject_NSDiscardableContentProxy for NSObject {}
pub trait NSObject_NSDiscardableContentProxy: Sized + std::ops::Deref {
    unsafe fn autoContentAccessingProxy(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, autoContentAccessingProxy) }
    }
}
unsafe extern "C" {
    pub fn NSAllocateObject(aClass: Class, extraBytes: NSUInteger, zone: *mut NSZone) -> id;
}
unsafe extern "C" {
    pub fn NSDeallocateObject(object: id);
}
unsafe extern "C" {
    pub fn NSCopyObject(object: id, extraBytes: NSUInteger, zone: *mut NSZone) -> id;
}
unsafe extern "C" {
    pub fn NSShouldRetainWithZone(anObject: id, requestedZone: *mut NSZone) -> BOOL;
}
unsafe extern "C" {
    pub fn NSIncrementExtraRefCount(object: id);
}
unsafe extern "C" {
    pub fn NSDecrementExtraRefCountWasZero(object: id) -> BOOL;
}
unsafe extern "C" {
    pub fn NSExtraRefCount(object: id) -> NSUInteger;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NSFastEnumerationState {
    pub state: ::std::os::raw::c_ulong,
    pub itemsPtr: *mut id,
    pub mutationsPtr: *mut ::std::os::raw::c_ulong,
    pub extra: [::std::os::raw::c_ulong; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NSFastEnumerationState"][::std::mem::size_of::<NSFastEnumerationState>() - 64usize];
    ["Alignment of NSFastEnumerationState"]
        [::std::mem::align_of::<NSFastEnumerationState>() - 8usize];
    ["Offset of field: NSFastEnumerationState::state"]
        [::std::mem::offset_of!(NSFastEnumerationState, state) - 0usize];
    ["Offset of field: NSFastEnumerationState::itemsPtr"]
        [::std::mem::offset_of!(NSFastEnumerationState, itemsPtr) - 8usize];
    ["Offset of field: NSFastEnumerationState::mutationsPtr"]
        [::std::mem::offset_of!(NSFastEnumerationState, mutationsPtr) - 16usize];
    ["Offset of field: NSFastEnumerationState::extra"]
        [::std::mem::offset_of!(NSFastEnumerationState, extra) - 24usize];
};
pub trait PNSFastEnumeration: Sized + std::ops::Deref {
    unsafe fn countByEnumeratingWithState_objects_count_(
        &self,
        state: *mut NSFastEnumerationState,
        buffer: *mut id,
        len: NSUInteger,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , countByEnumeratingWithState : state objects : buffer count : len)
        }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSEnumerator(pub id);
impl std::ops::Deref for NSEnumerator {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSEnumerator {}
impl NSEnumerator {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSEnumerator), alloc) })
    }
}
impl PNSFastEnumeration for NSEnumerator {}
impl INSObject for NSEnumerator {}
impl PNSObject for NSEnumerator {}
impl From<NSEnumerator> for NSObject {
    fn from(child: NSEnumerator) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSEnumerator {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSEnumerator, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSEnumerator)) };
        if is_kind_of {
            Ok(NSEnumerator(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSEnumerator")
        }
    }
}
impl<ObjectType: 'static> INSEnumerator<ObjectType> for NSEnumerator {}
pub trait INSEnumerator<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn nextObject(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, nextObject) }
    }
}
impl<ObjectType: 'static> NSEnumerator_NSExtendedEnumerator<ObjectType> for NSEnumerator {}
pub trait NSEnumerator_NSExtendedEnumerator<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn allObjects(&self) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allObjects) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSValue(pub id);
impl std::ops::Deref for NSValue {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSValue {}
impl NSValue {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSValue), alloc) })
    }
}
impl PNSCopying for NSValue {}
impl PNSSecureCoding for NSValue {}
impl INSObject for NSValue {}
impl PNSObject for NSValue {}
impl From<NSValue> for NSObject {
    fn from(child: NSValue) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSValue {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSValue, Self::Error> {
        let is_kind_of: bool = unsafe { msg_send ! (parent , isKindOfClass : class ! (NSValue)) };
        if is_kind_of {
            Ok(NSValue(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSValue")
        }
    }
}
impl INSValue for NSValue {}
pub trait INSValue: Sized + std::ops::Deref {
    unsafe fn getValue_size_(&self, value: *mut ::std::os::raw::c_void, size: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getValue : value size : size) }
    }
    unsafe fn initWithBytes_objCType_(
        &self,
        value: *const ::std::os::raw::c_void,
        type_: *const ::std::os::raw::c_char,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithBytes : value objCType : type_) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
    unsafe fn objCType(&self) -> *const ::std::os::raw::c_char
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, objCType) }
    }
}
impl NSValue_NSValueCreation for NSValue {}
pub trait NSValue_NSValueCreation: Sized + std::ops::Deref {
    unsafe fn valueWithBytes_objCType_(
        value: *const ::std::os::raw::c_void,
        type_: *const ::std::os::raw::c_char,
    ) -> NSValue
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSValue) , valueWithBytes : value objCType : type_) }
    }
    unsafe fn value_withObjCType_(
        value: *const ::std::os::raw::c_void,
        type_: *const ::std::os::raw::c_char,
    ) -> NSValue
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSValue) , value : value withObjCType : type_) }
    }
}
impl NSValue_NSValueExtensionMethods for NSValue {}
pub trait NSValue_NSValueExtensionMethods: Sized + std::ops::Deref {
    unsafe fn isEqualToValue_(&self, value: NSValue) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqualToValue : value) }
    }
    unsafe fn nonretainedObjectValue(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, nonretainedObjectValue) }
    }
    unsafe fn pointerValue(&self) -> *mut ::std::os::raw::c_void
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, pointerValue) }
    }
    unsafe fn valueWithNonretainedObject_(anObject: id) -> NSValue
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSValue) , valueWithNonretainedObject : anObject) }
    }
    unsafe fn valueWithPointer_(pointer: *const ::std::os::raw::c_void) -> NSValue
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSValue) , valueWithPointer : pointer) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSNumber(pub id);
impl std::ops::Deref for NSNumber {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSNumber {}
impl NSNumber {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSNumber), alloc) })
    }
}
impl INSValue for NSNumber {}
impl PNSCopying for NSNumber {}
impl PNSSecureCoding for NSNumber {}
impl From<NSNumber> for NSValue {
    fn from(child: NSNumber) -> NSValue {
        NSValue(child.0)
    }
}
impl std::convert::TryFrom<NSValue> for NSNumber {
    type Error = &'static str;
    fn try_from(parent: NSValue) -> Result<NSNumber, Self::Error> {
        let is_kind_of: bool = unsafe { msg_send ! (parent , isKindOfClass : class ! (NSNumber)) };
        if is_kind_of {
            Ok(NSNumber(parent.0))
        } else {
            Err("This NSValue cannot be downcasted to NSNumber")
        }
    }
}
impl INSObject for NSNumber {}
impl PNSObject for NSNumber {}
impl From<NSNumber> for NSObject {
    fn from(child: NSNumber) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSNumber {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSNumber, Self::Error> {
        let is_kind_of: bool = unsafe { msg_send ! (parent , isKindOfClass : class ! (NSNumber)) };
        if is_kind_of {
            Ok(NSNumber(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSNumber")
        }
    }
}
impl INSNumber for NSNumber {}
pub trait INSNumber: Sized + std::ops::Deref {
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
    unsafe fn initWithChar_(&self, value: ::std::os::raw::c_char) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithChar : value) }
    }
    unsafe fn initWithUnsignedChar_(&self, value: ::std::os::raw::c_uchar) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedChar : value) }
    }
    unsafe fn initWithShort_(&self, value: ::std::os::raw::c_short) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithShort : value) }
    }
    unsafe fn initWithUnsignedShort_(&self, value: ::std::os::raw::c_ushort) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedShort : value) }
    }
    unsafe fn initWithInt_(&self, value: ::std::os::raw::c_int) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithInt : value) }
    }
    unsafe fn initWithUnsignedInt_(&self, value: ::std::os::raw::c_uint) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedInt : value) }
    }
    unsafe fn initWithLong_(&self, value: ::std::os::raw::c_long) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithLong : value) }
    }
    unsafe fn initWithUnsignedLong_(&self, value: ::std::os::raw::c_ulong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedLong : value) }
    }
    unsafe fn initWithLongLong_(&self, value: ::std::os::raw::c_longlong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithLongLong : value) }
    }
    unsafe fn initWithUnsignedLongLong_(&self, value: ::std::os::raw::c_ulonglong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedLongLong : value) }
    }
    unsafe fn initWithFloat_(&self, value: f32) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithFloat : value) }
    }
    unsafe fn initWithDouble_(&self, value: f64) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithDouble : value) }
    }
    unsafe fn initWithBool_(&self, value: BOOL) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithBool : value) }
    }
    unsafe fn initWithInteger_(&self, value: NSInteger) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithInteger : value) }
    }
    unsafe fn initWithUnsignedInteger_(&self, value: NSUInteger) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithUnsignedInteger : value) }
    }
    unsafe fn compare_(&self, otherNumber: NSNumber) -> NSComparisonResult
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , compare : otherNumber) }
    }
    unsafe fn isEqualToNumber_(&self, number: NSNumber) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqualToNumber : number) }
    }
    unsafe fn descriptionWithLocale_(&self, locale: id) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , descriptionWithLocale : locale) }
    }
    unsafe fn charValue(&self) -> ::std::os::raw::c_char
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, charValue) }
    }
    unsafe fn unsignedCharValue(&self) -> ::std::os::raw::c_uchar
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedCharValue) }
    }
    unsafe fn shortValue(&self) -> ::std::os::raw::c_short
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, shortValue) }
    }
    unsafe fn unsignedShortValue(&self) -> ::std::os::raw::c_ushort
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedShortValue) }
    }
    unsafe fn intValue(&self) -> ::std::os::raw::c_int
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, intValue) }
    }
    unsafe fn unsignedIntValue(&self) -> ::std::os::raw::c_uint
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedIntValue) }
    }
    unsafe fn longValue(&self) -> ::std::os::raw::c_long
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, longValue) }
    }
    unsafe fn unsignedLongValue(&self) -> ::std::os::raw::c_ulong
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedLongValue) }
    }
    unsafe fn longLongValue(&self) -> ::std::os::raw::c_longlong
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, longLongValue) }
    }
    unsafe fn unsignedLongLongValue(&self) -> ::std::os::raw::c_ulonglong
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedLongLongValue) }
    }
    unsafe fn floatValue(&self) -> f32
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, floatValue) }
    }
    unsafe fn doubleValue(&self) -> f64
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, doubleValue) }
    }
    unsafe fn boolValue(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, boolValue) }
    }
    unsafe fn integerValue(&self) -> NSInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, integerValue) }
    }
    unsafe fn unsignedIntegerValue(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, unsignedIntegerValue) }
    }
    unsafe fn stringValue(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, stringValue) }
    }
}
impl NSNumber_NSNumberCreation for NSNumber {}
pub trait NSNumber_NSNumberCreation: Sized + std::ops::Deref {
    unsafe fn numberWithChar_(value: ::std::os::raw::c_char) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithChar : value) }
    }
    unsafe fn numberWithUnsignedChar_(value: ::std::os::raw::c_uchar) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedChar : value) }
    }
    unsafe fn numberWithShort_(value: ::std::os::raw::c_short) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithShort : value) }
    }
    unsafe fn numberWithUnsignedShort_(value: ::std::os::raw::c_ushort) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedShort : value) }
    }
    unsafe fn numberWithInt_(value: ::std::os::raw::c_int) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithInt : value) }
    }
    unsafe fn numberWithUnsignedInt_(value: ::std::os::raw::c_uint) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedInt : value) }
    }
    unsafe fn numberWithLong_(value: ::std::os::raw::c_long) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithLong : value) }
    }
    unsafe fn numberWithUnsignedLong_(value: ::std::os::raw::c_ulong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedLong : value) }
    }
    unsafe fn numberWithLongLong_(value: ::std::os::raw::c_longlong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithLongLong : value) }
    }
    unsafe fn numberWithUnsignedLongLong_(value: ::std::os::raw::c_ulonglong) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedLongLong : value) }
    }
    unsafe fn numberWithFloat_(value: f32) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithFloat : value) }
    }
    unsafe fn numberWithDouble_(value: f64) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithDouble : value) }
    }
    unsafe fn numberWithBool_(value: BOOL) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithBool : value) }
    }
    unsafe fn numberWithInteger_(value: NSInteger) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithInteger : value) }
    }
    unsafe fn numberWithUnsignedInteger_(value: NSUInteger) -> NSNumber
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSNumber) , numberWithUnsignedInteger : value) }
    }
}
impl NSValue_NSDeprecated for NSValue {}
pub trait NSValue_NSDeprecated: Sized + std::ops::Deref {
    unsafe fn getValue_(&self, value: *mut ::std::os::raw::c_void)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getValue : value) }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NSRange {
    pub location: NSUInteger,
    pub length: NSUInteger,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NSRange"][::std::mem::size_of::<_NSRange>() - 16usize];
    ["Alignment of _NSRange"][::std::mem::align_of::<_NSRange>() - 8usize];
    ["Offset of field: _NSRange::location"][::std::mem::offset_of!(_NSRange, location) - 0usize];
    ["Offset of field: _NSRange::length"][::std::mem::offset_of!(_NSRange, length) - 8usize];
};
pub type NSRange = _NSRange;
pub type NSRangePointer = *mut NSRange;
unsafe extern "C" {
    pub fn NSUnionRange(range1: NSRange, range2: NSRange) -> NSRange;
}
unsafe extern "C" {
    pub fn NSIntersectionRange(range1: NSRange, range2: NSRange) -> NSRange;
}
unsafe extern "C" {
    pub fn NSStringFromRange(range: NSRange) -> NSString;
}
unsafe extern "C" {
    pub fn NSRangeFromString(aString: NSString) -> NSRange;
}
impl NSValue_NSValueRangeExtensions for NSValue {}
pub trait NSValue_NSValueRangeExtensions: Sized + std::ops::Deref {
    unsafe fn rangeValue(&self) -> NSRange
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, rangeValue) }
    }
    unsafe fn valueWithRange_(range: NSRange) -> NSValue
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSValue) , valueWithRange : range) }
    }
}
pub const NSCollectionChangeType_NSCollectionChangeInsert: NSCollectionChangeType = 0;
pub const NSCollectionChangeType_NSCollectionChangeRemove: NSCollectionChangeType = 1;
pub type NSCollectionChangeType = NSInteger;
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSOrderedCollectionChange(pub id);
impl std::ops::Deref for NSOrderedCollectionChange {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSOrderedCollectionChange {}
impl NSOrderedCollectionChange {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSOrderedCollectionChange), alloc) })
    }
}
impl INSObject for NSOrderedCollectionChange {}
impl PNSObject for NSOrderedCollectionChange {}
impl From<NSOrderedCollectionChange> for NSObject {
    fn from(child: NSOrderedCollectionChange) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSOrderedCollectionChange {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSOrderedCollectionChange, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSOrderedCollectionChange)) };
        if is_kind_of {
            Ok(NSOrderedCollectionChange(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSOrderedCollectionChange")
        }
    }
}
impl<ObjectType: 'static> INSOrderedCollectionChange<ObjectType> for NSOrderedCollectionChange {}
pub trait INSOrderedCollectionChange<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn init(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn initWithObject_type_index_(
        &self,
        anObject: id,
        type_: NSCollectionChangeType,
        index: NSUInteger,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObject : anObject r#type : type_ index : index) }
    }
    unsafe fn initWithObject_type_index_associatedIndex_(
        &self,
        anObject: id,
        type_: NSCollectionChangeType,
        index: NSUInteger,
        associatedIndex: NSUInteger,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , initWithObject : anObject r#type : type_ index : index associatedIndex : associatedIndex)
        }
    }
    unsafe fn object(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, object) }
    }
    unsafe fn changeType(&self) -> NSCollectionChangeType
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, changeType) }
    }
    unsafe fn index(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, index) }
    }
    unsafe fn associatedIndex(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, associatedIndex) }
    }
    unsafe fn changeWithObject_type_index_(
        anObject: id,
        type_: NSCollectionChangeType,
        index: NSUInteger,
    ) -> NSOrderedCollectionChange
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (class ! (NSOrderedCollectionChange) , changeWithObject : anObject r#type : type_ index : index)
        }
    }
    unsafe fn changeWithObject_type_index_associatedIndex_(
        anObject: id,
        type_: NSCollectionChangeType,
        index: NSUInteger,
        associatedIndex: NSUInteger,
    ) -> NSOrderedCollectionChange
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (class ! (NSOrderedCollectionChange) , changeWithObject : anObject r#type : type_ index : index associatedIndex : associatedIndex)
        }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSIndexSet(pub id);
impl std::ops::Deref for NSIndexSet {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSIndexSet {}
impl NSIndexSet {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSIndexSet), alloc) })
    }
}
impl PNSCopying for NSIndexSet {}
impl PNSMutableCopying for NSIndexSet {}
impl PNSSecureCoding for NSIndexSet {}
impl INSObject for NSIndexSet {}
impl PNSObject for NSIndexSet {}
impl From<NSIndexSet> for NSObject {
    fn from(child: NSIndexSet) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSIndexSet {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSIndexSet, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSIndexSet)) };
        if is_kind_of {
            Ok(NSIndexSet(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSIndexSet")
        }
    }
}
impl INSIndexSet for NSIndexSet {}
pub trait INSIndexSet: Sized + std::ops::Deref {
    unsafe fn initWithIndexesInRange_(&self, range: NSRange) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithIndexesInRange : range) }
    }
    unsafe fn initWithIndexSet_(&self, indexSet: NSIndexSet) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithIndexSet : indexSet) }
    }
    unsafe fn initWithIndex_(&self, value: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithIndex : value) }
    }
    unsafe fn isEqualToIndexSet_(&self, indexSet: NSIndexSet) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqualToIndexSet : indexSet) }
    }
    unsafe fn indexGreaterThanIndex_(&self, value: NSUInteger) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexGreaterThanIndex : value) }
    }
    unsafe fn indexLessThanIndex_(&self, value: NSUInteger) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexLessThanIndex : value) }
    }
    unsafe fn indexGreaterThanOrEqualToIndex_(&self, value: NSUInteger) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexGreaterThanOrEqualToIndex : value) }
    }
    unsafe fn indexLessThanOrEqualToIndex_(&self, value: NSUInteger) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexLessThanOrEqualToIndex : value) }
    }
    unsafe fn getIndexes_maxCount_inIndexRange_(
        &self,
        indexBuffer: *mut NSUInteger,
        bufferSize: NSUInteger,
        range: NSRangePointer,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , getIndexes : indexBuffer maxCount : bufferSize inIndexRange : range)
        }
    }
    unsafe fn countOfIndexesInRange_(&self, range: NSRange) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , countOfIndexesInRange : range) }
    }
    unsafe fn containsIndex_(&self, value: NSUInteger) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , containsIndex : value) }
    }
    unsafe fn containsIndexesInRange_(&self, range: NSRange) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , containsIndexesInRange : range) }
    }
    unsafe fn containsIndexes_(&self, indexSet: NSIndexSet) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , containsIndexes : indexSet) }
    }
    unsafe fn intersectsIndexesInRange_(&self, range: NSRange) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , intersectsIndexesInRange : range) }
    }
    unsafe fn enumerateIndexesUsingBlock_(&self, block: *mut ::std::os::raw::c_void)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateIndexesUsingBlock : block) }
    }
    unsafe fn enumerateIndexesWithOptions_usingBlock_(
        &self,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateIndexesWithOptions : opts usingBlock : block) }
    }
    unsafe fn enumerateIndexesInRange_options_usingBlock_(
        &self,
        range: NSRange,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , enumerateIndexesInRange : range options : opts usingBlock : block)
        }
    }
    unsafe fn indexPassingTest_(&self, predicate: *mut ::std::os::raw::c_void) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexPassingTest : predicate) }
    }
    unsafe fn indexWithOptions_passingTest_(
        &self,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexWithOptions : opts passingTest : predicate) }
    }
    unsafe fn indexInRange_options_passingTest_(
        &self,
        range: NSRange,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexInRange : range options : opts passingTest : predicate) }
    }
    unsafe fn indexesPassingTest_(&self, predicate: *mut ::std::os::raw::c_void) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexesPassingTest : predicate) }
    }
    unsafe fn indexesWithOptions_passingTest_(
        &self,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexesWithOptions : opts passingTest : predicate) }
    }
    unsafe fn indexesInRange_options_passingTest_(
        &self,
        range: NSRange,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , indexesInRange : range options : opts passingTest : predicate)
        }
    }
    unsafe fn enumerateRangesUsingBlock_(&self, block: *mut ::std::os::raw::c_void)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateRangesUsingBlock : block) }
    }
    unsafe fn enumerateRangesWithOptions_usingBlock_(
        &self,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateRangesWithOptions : opts usingBlock : block) }
    }
    unsafe fn enumerateRangesInRange_options_usingBlock_(
        &self,
        range: NSRange,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , enumerateRangesInRange : range options : opts usingBlock : block)
        }
    }
    unsafe fn count(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, count) }
    }
    unsafe fn firstIndex(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, firstIndex) }
    }
    unsafe fn lastIndex(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, lastIndex) }
    }
    unsafe fn indexSet() -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSIndexSet), indexSet) }
    }
    unsafe fn indexSetWithIndex_(value: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSIndexSet) , indexSetWithIndex : value) }
    }
    unsafe fn indexSetWithIndexesInRange_(range: NSRange) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSIndexSet) , indexSetWithIndexesInRange : range) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSMutableIndexSet(pub id);
impl std::ops::Deref for NSMutableIndexSet {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSMutableIndexSet {}
impl NSMutableIndexSet {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSMutableIndexSet), alloc) })
    }
}
impl INSIndexSet for NSMutableIndexSet {}
impl PNSCopying for NSMutableIndexSet {}
impl PNSMutableCopying for NSMutableIndexSet {}
impl PNSSecureCoding for NSMutableIndexSet {}
impl From<NSMutableIndexSet> for NSIndexSet {
    fn from(child: NSMutableIndexSet) -> NSIndexSet {
        NSIndexSet(child.0)
    }
}
impl std::convert::TryFrom<NSIndexSet> for NSMutableIndexSet {
    type Error = &'static str;
    fn try_from(parent: NSIndexSet) -> Result<NSMutableIndexSet, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSMutableIndexSet)) };
        if is_kind_of {
            Ok(NSMutableIndexSet(parent.0))
        } else {
            Err("This NSIndexSet cannot be downcasted to NSMutableIndexSet")
        }
    }
}
impl INSObject for NSMutableIndexSet {}
impl PNSObject for NSMutableIndexSet {}
impl From<NSMutableIndexSet> for NSObject {
    fn from(child: NSMutableIndexSet) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSMutableIndexSet {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSMutableIndexSet, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSMutableIndexSet)) };
        if is_kind_of {
            Ok(NSMutableIndexSet(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSMutableIndexSet")
        }
    }
}
impl INSMutableIndexSet for NSMutableIndexSet {}
pub trait INSMutableIndexSet: Sized + std::ops::Deref {
    unsafe fn addIndexes_(&self, indexSet: NSIndexSet)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addIndexes : indexSet) }
    }
    unsafe fn removeIndexes_(&self, indexSet: NSIndexSet)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeIndexes : indexSet) }
    }
    unsafe fn removeAllIndexes(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, removeAllIndexes) }
    }
    unsafe fn addIndex_(&self, value: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addIndex : value) }
    }
    unsafe fn removeIndex_(&self, value: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeIndex : value) }
    }
    unsafe fn addIndexesInRange_(&self, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addIndexesInRange : range) }
    }
    unsafe fn removeIndexesInRange_(&self, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeIndexesInRange : range) }
    }
    unsafe fn shiftIndexesStartingAtIndex_by_(&self, index: NSUInteger, delta: NSInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , shiftIndexesStartingAtIndex : index by : delta) }
    }
}
pub const NSOrderedCollectionDifferenceCalculationOptions_NSOrderedCollectionDifferenceCalculationOmitInsertedObjects : NSOrderedCollectionDifferenceCalculationOptions = 1 ;
pub const NSOrderedCollectionDifferenceCalculationOptions_NSOrderedCollectionDifferenceCalculationOmitRemovedObjects : NSOrderedCollectionDifferenceCalculationOptions = 2 ;
pub const NSOrderedCollectionDifferenceCalculationOptions_NSOrderedCollectionDifferenceCalculationInferMoves : NSOrderedCollectionDifferenceCalculationOptions = 4 ;
pub type NSOrderedCollectionDifferenceCalculationOptions = NSUInteger;
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSOrderedCollectionDifference(pub id);
impl std::ops::Deref for NSOrderedCollectionDifference {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSOrderedCollectionDifference {}
impl NSOrderedCollectionDifference {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSOrderedCollectionDifference), alloc) })
    }
}
impl PNSFastEnumeration for NSOrderedCollectionDifference {}
impl INSObject for NSOrderedCollectionDifference {}
impl PNSObject for NSOrderedCollectionDifference {}
impl From<NSOrderedCollectionDifference> for NSObject {
    fn from(child: NSOrderedCollectionDifference) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSOrderedCollectionDifference {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSOrderedCollectionDifference, Self::Error> {
        let is_kind_of: bool = unsafe {
            msg_send ! (parent , isKindOfClass : class ! (NSOrderedCollectionDifference))
        };
        if is_kind_of {
            Ok(NSOrderedCollectionDifference(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSOrderedCollectionDifference")
        }
    }
}
impl<ObjectType: 'static> INSOrderedCollectionDifference<ObjectType>
    for NSOrderedCollectionDifference
{
}
pub trait INSOrderedCollectionDifference<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn initWithChanges_(&self, changes: NSArray) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithChanges : changes) }
    }
    unsafe fn initWithInsertIndexes_insertedObjects_removeIndexes_removedObjects_additionalChanges_(
        &self,
        inserts: NSIndexSet,
        insertedObjects: NSArray,
        removes: NSIndexSet,
        removedObjects: NSArray,
        changes: NSArray,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , initWithInsertIndexes : inserts insertedObjects : insertedObjects removeIndexes : removes removedObjects : removedObjects additionalChanges : changes)
        }
    }
    unsafe fn initWithInsertIndexes_insertedObjects_removeIndexes_removedObjects_(
        &self,
        inserts: NSIndexSet,
        insertedObjects: NSArray,
        removes: NSIndexSet,
        removedObjects: NSArray,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , initWithInsertIndexes : inserts insertedObjects : insertedObjects removeIndexes : removes removedObjects : removedObjects)
        }
    }
    unsafe fn differenceByTransformingChangesWithBlock_(
        &self,
        block: *mut ::std::os::raw::c_void,
    ) -> NSOrderedCollectionDifference
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , differenceByTransformingChangesWithBlock : block) }
    }
    unsafe fn inverseDifference(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, inverseDifference) }
    }
    unsafe fn insertions(&self) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, insertions) }
    }
    unsafe fn removals(&self) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, removals) }
    }
    unsafe fn hasChanges(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, hasChanges) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSArray(pub id);
impl std::ops::Deref for NSArray {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSArray {}
impl NSArray {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSArray), alloc) })
    }
}
impl PNSCopying for NSArray {}
impl PNSMutableCopying for NSArray {}
impl PNSSecureCoding for NSArray {}
impl PNSFastEnumeration for NSArray {}
impl INSObject for NSArray {}
impl PNSObject for NSArray {}
impl From<NSArray> for NSObject {
    fn from(child: NSArray) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSArray {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSArray, Self::Error> {
        let is_kind_of: bool = unsafe { msg_send ! (parent , isKindOfClass : class ! (NSArray)) };
        if is_kind_of {
            Ok(NSArray(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSArray")
        }
    }
}
impl<ObjectType: 'static> INSArray<ObjectType> for NSArray {}
pub trait INSArray<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn objectAtIndex_(&self, index: NSUInteger) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectAtIndex : index) }
    }
    unsafe fn init(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn initWithObjects_count_(
        &self,
        objects: *const *mut u64,
        cnt: NSUInteger,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObjects : objects count : cnt) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
    unsafe fn count(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, count) }
    }
}
impl<ObjectType: 'static> NSArray_NSExtendedArray<ObjectType> for NSArray {}
pub trait NSArray_NSExtendedArray<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn arrayByAddingObject_(&self, anObject: id) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , arrayByAddingObject : anObject) }
    }
    unsafe fn arrayByAddingObjectsFromArray_(&self, otherArray: NSArray) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , arrayByAddingObjectsFromArray : otherArray) }
    }
    unsafe fn componentsJoinedByString_(&self, separator: NSString) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , componentsJoinedByString : separator) }
    }
    unsafe fn containsObject_(&self, anObject: id) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , containsObject : anObject) }
    }
    unsafe fn descriptionWithLocale_(&self, locale: id) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , descriptionWithLocale : locale) }
    }
    unsafe fn descriptionWithLocale_indent_(&self, locale: id, level: NSUInteger) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , descriptionWithLocale : locale indent : level) }
    }
    unsafe fn firstObjectCommonWithArray_(&self, otherArray: NSArray) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , firstObjectCommonWithArray : otherArray) }
    }
    unsafe fn getObjects_range_(&self, objects: *mut id, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getObjects : objects range : range) }
    }
    unsafe fn indexOfObject_(&self, anObject: id) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObject : anObject) }
    }
    unsafe fn indexOfObject_inRange_(&self, anObject: id, range: NSRange) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObject : anObject inRange : range) }
    }
    unsafe fn indexOfObjectIdenticalTo_(&self, anObject: id) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObjectIdenticalTo : anObject) }
    }
    unsafe fn indexOfObjectIdenticalTo_inRange_(&self, anObject: id, range: NSRange) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObjectIdenticalTo : anObject inRange : range) }
    }
    unsafe fn isEqualToArray_(&self, otherArray: NSArray) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqualToArray : otherArray) }
    }
    unsafe fn objectEnumerator(&self) -> NSEnumerator
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, objectEnumerator) }
    }
    unsafe fn reverseObjectEnumerator(&self) -> NSEnumerator
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, reverseObjectEnumerator) }
    }
    unsafe fn sortedArrayUsingFunction_context_(
        &self,
        comparator: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: id,
                arg2: id,
                arg3: *mut ::std::os::raw::c_void,
            ) -> NSInteger,
        >,
        context: *mut ::std::os::raw::c_void,
    ) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortedArrayUsingFunction : comparator context : context) }
    }
    unsafe fn sortedArrayUsingFunction_context_hint_(
        &self,
        comparator: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: id,
                arg2: id,
                arg3: *mut ::std::os::raw::c_void,
            ) -> NSInteger,
        >,
        context: *mut ::std::os::raw::c_void,
        hint: NSData,
    ) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , sortedArrayUsingFunction : comparator context : context hint : hint)
        }
    }
    unsafe fn sortedArrayUsingSelector_(&self, comparator: objc::runtime::Sel) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortedArrayUsingSelector : comparator) }
    }
    unsafe fn subarrayWithRange_(&self, range: NSRange) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , subarrayWithRange : range) }
    }
    unsafe fn writeToURL_error_(&self, url: NSURL, error: *mut NSError) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToURL : url error : error) }
    }
    unsafe fn makeObjectsPerformSelector_(&self, aSelector: objc::runtime::Sel)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , makeObjectsPerformSelector : aSelector) }
    }
    unsafe fn makeObjectsPerformSelector_withObject_(
        &self,
        aSelector: objc::runtime::Sel,
        argument: id,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , makeObjectsPerformSelector : aSelector withObject : argument)
        }
    }
    unsafe fn objectsAtIndexes_(&self, indexes: NSIndexSet) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectsAtIndexes : indexes) }
    }
    unsafe fn objectAtIndexedSubscript_(&self, idx: NSUInteger) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectAtIndexedSubscript : idx) }
    }
    unsafe fn enumerateObjectsUsingBlock_(&self, block: *mut ::std::os::raw::c_void)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateObjectsUsingBlock : block) }
    }
    unsafe fn enumerateObjectsWithOptions_usingBlock_(
        &self,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateObjectsWithOptions : opts usingBlock : block) }
    }
    unsafe fn enumerateObjectsAtIndexes_options_usingBlock_(
        &self,
        s: NSIndexSet,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , enumerateObjectsAtIndexes : s options : opts usingBlock : block)
        }
    }
    unsafe fn indexOfObjectPassingTest_(&self, predicate: *mut ::std::os::raw::c_void) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObjectPassingTest : predicate) }
    }
    unsafe fn indexOfObjectWithOptions_passingTest_(
        &self,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexOfObjectWithOptions : opts passingTest : predicate) }
    }
    unsafe fn indexOfObjectAtIndexes_options_passingTest_(
        &self,
        s: NSIndexSet,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , indexOfObjectAtIndexes : s options : opts passingTest : predicate)
        }
    }
    unsafe fn indexesOfObjectsPassingTest_(
        &self,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexesOfObjectsPassingTest : predicate) }
    }
    unsafe fn indexesOfObjectsWithOptions_passingTest_(
        &self,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , indexesOfObjectsWithOptions : opts passingTest : predicate) }
    }
    unsafe fn indexesOfObjectsAtIndexes_options_passingTest_(
        &self,
        s: NSIndexSet,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSIndexSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , indexesOfObjectsAtIndexes : s options : opts passingTest : predicate)
        }
    }
    unsafe fn sortedArrayUsingComparator_(&self, cmptr: NSComparator) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortedArrayUsingComparator : cmptr) }
    }
    unsafe fn sortedArrayWithOptions_usingComparator_(
        &self,
        opts: NSSortOptions,
        cmptr: NSComparator,
    ) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortedArrayWithOptions : opts usingComparator : cmptr) }
    }
    unsafe fn indexOfObject_inSortedRange_options_usingComparator_(
        &self,
        obj: id,
        r: NSRange,
        opts: NSBinarySearchingOptions,
        cmp: NSComparator,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , indexOfObject : obj inSortedRange : r options : opts usingComparator : cmp)
        }
    }
    unsafe fn description(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, description) }
    }
    unsafe fn firstObject(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, firstObject) }
    }
    unsafe fn lastObject(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, lastObject) }
    }
    unsafe fn sortedArrayHint(&self) -> NSData
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, sortedArrayHint) }
    }
}
pub const NSBinarySearchingOptions_NSBinarySearchingFirstEqual: NSBinarySearchingOptions = 256;
pub const NSBinarySearchingOptions_NSBinarySearchingLastEqual: NSBinarySearchingOptions = 512;
pub const NSBinarySearchingOptions_NSBinarySearchingInsertionIndex: NSBinarySearchingOptions = 1024;
pub type NSBinarySearchingOptions = NSUInteger;
impl<ObjectType: 'static> NSArray_NSArrayCreation<ObjectType> for NSArray {}
pub trait NSArray_NSArrayCreation<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn initWithObjects_(&self, firstObj: id) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObjects : firstObj) }
    }
    unsafe fn initWithArray_(&self, array: NSArray) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithArray : array) }
    }
    unsafe fn initWithArray_copyItems_(&self, array: NSArray, flag: BOOL) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithArray : array copyItems : flag) }
    }
    unsafe fn initWithContentsOfURL_error_(&self, url: NSURL, error: *mut NSError) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url error : error) }
    }
    unsafe fn array() -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSArray), array) }
    }
    unsafe fn arrayWithObject_(anObject: id) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithObject : anObject) }
    }
    unsafe fn arrayWithObjects_count_(objects: *const *mut u64, cnt: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithObjects : objects count : cnt) }
    }
    unsafe fn arrayWithObjects_(firstObj: id) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithObjects : firstObj) }
    }
    unsafe fn arrayWithArray_(array: NSArray) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithArray : array) }
    }
    unsafe fn arrayWithContentsOfURL_error_(url: NSURL, error: *mut NSError) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithContentsOfURL : url error : error) }
    }
}
impl<ObjectType: 'static> NSArray_NSArrayDiffing<ObjectType> for NSArray {}
pub trait NSArray_NSArrayDiffing<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn differenceFromArray_withOptions_usingEquivalenceTest_(
        &self,
        other: NSArray,
        options: NSOrderedCollectionDifferenceCalculationOptions,
        block: *mut ::std::os::raw::c_void,
    ) -> NSOrderedCollectionDifference
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , differenceFromArray : other withOptions : options usingEquivalenceTest : block)
        }
    }
    unsafe fn differenceFromArray_withOptions_(
        &self,
        other: NSArray,
        options: NSOrderedCollectionDifferenceCalculationOptions,
    ) -> NSOrderedCollectionDifference
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , differenceFromArray : other withOptions : options) }
    }
    unsafe fn differenceFromArray_(&self, other: NSArray) -> NSOrderedCollectionDifference
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , differenceFromArray : other) }
    }
    unsafe fn arrayByApplyingDifference_(
        &self,
        difference: NSOrderedCollectionDifference,
    ) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , arrayByApplyingDifference : difference) }
    }
}
impl<ObjectType: 'static> NSArray_NSDeprecated<ObjectType> for NSArray {}
pub trait NSArray_NSDeprecated<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn getObjects_(&self, objects: *mut id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getObjects : objects) }
    }
    unsafe fn initWithContentsOfFile_(&self, path: NSString) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfFile : path) }
    }
    unsafe fn initWithContentsOfURL_(&self, url: NSURL) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url) }
    }
    unsafe fn writeToFile_atomically_(&self, path: NSString, useAuxiliaryFile: BOOL) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToFile : path atomically : useAuxiliaryFile) }
    }
    unsafe fn writeToURL_atomically_(&self, url: NSURL, atomically: BOOL) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToURL : url atomically : atomically) }
    }
    unsafe fn arrayWithContentsOfFile_(path: NSString) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithContentsOfFile : path) }
    }
    unsafe fn arrayWithContentsOfURL_(url: NSURL) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSArray) , arrayWithContentsOfURL : url) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSMutableArray(pub id);
impl std::ops::Deref for NSMutableArray {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSMutableArray {}
impl NSMutableArray {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSMutableArray), alloc) })
    }
}
impl<ObjectType: 'static> INSArray<ObjectType> for NSMutableArray {}
impl PNSCopying for NSMutableArray {}
impl PNSMutableCopying for NSMutableArray {}
impl PNSSecureCoding for NSMutableArray {}
impl PNSFastEnumeration for NSMutableArray {}
impl INSObject for NSMutableArray {}
impl PNSObject for NSMutableArray {}
impl From<NSMutableArray> for NSObject {
    fn from(child: NSMutableArray) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSMutableArray {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSMutableArray, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSMutableArray)) };
        if is_kind_of {
            Ok(NSMutableArray(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSMutableArray")
        }
    }
}
impl<ObjectType: 'static> INSMutableArray<ObjectType> for NSMutableArray {}
pub trait INSMutableArray<ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn addObject_(&self, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addObject : anObject) }
    }
    unsafe fn insertObject_atIndex_(&self, anObject: id, index: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , insertObject : anObject atIndex : index) }
    }
    unsafe fn removeLastObject(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, removeLastObject) }
    }
    unsafe fn removeObjectAtIndex_(&self, index: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectAtIndex : index) }
    }
    unsafe fn replaceObjectAtIndex_withObject_(&self, index: NSUInteger, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , replaceObjectAtIndex : index withObject : anObject) }
    }
    unsafe fn init(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn initWithCapacity_(&self, numItems: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCapacity : numItems) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
}
impl<ObjectType: 'static> NSMutableArray_NSExtendedMutableArray<ObjectType> for NSMutableArray {}
pub trait NSMutableArray_NSExtendedMutableArray<ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn addObjectsFromArray_(&self, otherArray: NSArray)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addObjectsFromArray : otherArray) }
    }
    unsafe fn exchangeObjectAtIndex_withObjectAtIndex_(&self, idx1: NSUInteger, idx2: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , exchangeObjectAtIndex : idx1 withObjectAtIndex : idx2) }
    }
    unsafe fn removeAllObjects(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, removeAllObjects) }
    }
    unsafe fn removeObject_inRange_(&self, anObject: id, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObject : anObject inRange : range) }
    }
    unsafe fn removeObject_(&self, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObject : anObject) }
    }
    unsafe fn removeObjectIdenticalTo_inRange_(&self, anObject: id, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectIdenticalTo : anObject inRange : range) }
    }
    unsafe fn removeObjectIdenticalTo_(&self, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectIdenticalTo : anObject) }
    }
    unsafe fn removeObjectsFromIndices_numIndices_(&self, indices: *mut NSUInteger, cnt: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectsFromIndices : indices numIndices : cnt) }
    }
    unsafe fn removeObjectsInArray_(&self, otherArray: NSArray)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectsInArray : otherArray) }
    }
    unsafe fn removeObjectsInRange_(&self, range: NSRange)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectsInRange : range) }
    }
    unsafe fn replaceObjectsInRange_withObjectsFromArray_range_(
        &self,
        range: NSRange,
        otherArray: NSArray,
        otherRange: NSRange,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , replaceObjectsInRange : range withObjectsFromArray : otherArray range : otherRange)
        }
    }
    unsafe fn replaceObjectsInRange_withObjectsFromArray_(
        &self,
        range: NSRange,
        otherArray: NSArray,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , replaceObjectsInRange : range withObjectsFromArray : otherArray)
        }
    }
    unsafe fn setArray_(&self, otherArray: NSArray)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setArray : otherArray) }
    }
    unsafe fn sortUsingFunction_context_(
        &self,
        compare: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: id,
                arg2: id,
                arg3: *mut ::std::os::raw::c_void,
            ) -> NSInteger,
        >,
        context: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortUsingFunction : compare context : context) }
    }
    unsafe fn sortUsingSelector_(&self, comparator: objc::runtime::Sel)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortUsingSelector : comparator) }
    }
    unsafe fn insertObjects_atIndexes_(&self, objects: NSArray, indexes: NSIndexSet)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , insertObjects : objects atIndexes : indexes) }
    }
    unsafe fn removeObjectsAtIndexes_(&self, indexes: NSIndexSet)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectsAtIndexes : indexes) }
    }
    unsafe fn replaceObjectsAtIndexes_withObjects_(&self, indexes: NSIndexSet, objects: NSArray)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , replaceObjectsAtIndexes : indexes withObjects : objects) }
    }
    unsafe fn setObject_atIndexedSubscript_(&self, obj: id, idx: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setObject : obj atIndexedSubscript : idx) }
    }
    unsafe fn sortUsingComparator_(&self, cmptr: NSComparator)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortUsingComparator : cmptr) }
    }
    unsafe fn sortWithOptions_usingComparator_(&self, opts: NSSortOptions, cmptr: NSComparator)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , sortWithOptions : opts usingComparator : cmptr) }
    }
}
impl<ObjectType: 'static> NSMutableArray_NSMutableArrayCreation<ObjectType> for NSMutableArray {}
pub trait NSMutableArray_NSMutableArrayCreation<ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn initWithContentsOfFile_(&self, path: NSString) -> NSMutableArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfFile : path) }
    }
    unsafe fn initWithContentsOfURL_(&self, url: NSURL) -> NSMutableArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url) }
    }
    unsafe fn arrayWithCapacity_(numItems: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableArray) , arrayWithCapacity : numItems) }
    }
    unsafe fn arrayWithContentsOfFile_(path: NSString) -> NSMutableArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableArray) , arrayWithContentsOfFile : path) }
    }
    unsafe fn arrayWithContentsOfURL_(url: NSURL) -> NSMutableArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableArray) , arrayWithContentsOfURL : url) }
    }
}
impl<ObjectType: 'static> NSMutableArray_NSMutableArrayDiffing<ObjectType> for NSMutableArray {}
pub trait NSMutableArray_NSMutableArrayDiffing<ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn applyDifference_(&self, difference: NSOrderedCollectionDifference)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , applyDifference : difference) }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSDictionary(pub id);
impl std::ops::Deref for NSDictionary {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSDictionary {}
impl NSDictionary {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSDictionary), alloc) })
    }
}
impl PNSCopying for NSDictionary {}
impl PNSMutableCopying for NSDictionary {}
impl PNSSecureCoding for NSDictionary {}
impl PNSFastEnumeration for NSDictionary {}
impl INSObject for NSDictionary {}
impl PNSObject for NSDictionary {}
impl From<NSDictionary> for NSObject {
    fn from(child: NSDictionary) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSDictionary {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSDictionary, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSDictionary)) };
        if is_kind_of {
            Ok(NSDictionary(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSDictionary")
        }
    }
}
impl<KeyType: 'static, ObjectType: 'static> INSDictionary<KeyType, ObjectType> for NSDictionary {}
pub trait INSDictionary<KeyType: 'static, ObjectType: 'static>: Sized + std::ops::Deref {
    unsafe fn objectForKey_(&self, aKey: id) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectForKey : aKey) }
    }
    unsafe fn keyEnumerator(&self) -> NSEnumerator
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, keyEnumerator) }
    }
    unsafe fn init(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn initWithObjects_forKeys_count_(
        &self,
        objects: *const *mut u64,
        keys: *const *mut u64,
        cnt: NSUInteger,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObjects : objects forKeys : keys count : cnt) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
    unsafe fn count(&self) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, count) }
    }
}
impl<KeyType: 'static, ObjectType: 'static> NSDictionary_NSExtendedDictionary<KeyType, ObjectType>
    for NSDictionary
{
}
pub trait NSDictionary_NSExtendedDictionary<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn allKeysForObject_(&self, anObject: id) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , allKeysForObject : anObject) }
    }
    unsafe fn descriptionWithLocale_(&self, locale: id) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , descriptionWithLocale : locale) }
    }
    unsafe fn descriptionWithLocale_indent_(&self, locale: id, level: NSUInteger) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , descriptionWithLocale : locale indent : level) }
    }
    unsafe fn isEqualToDictionary_(&self, otherDictionary: NSDictionary) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , isEqualToDictionary : otherDictionary) }
    }
    unsafe fn objectEnumerator(&self) -> NSEnumerator
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, objectEnumerator) }
    }
    unsafe fn objectsForKeys_notFoundMarker_(&self, keys: NSArray, marker: id) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectsForKeys : keys notFoundMarker : marker) }
    }
    unsafe fn writeToURL_error_(&self, url: NSURL, error: *mut NSError) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToURL : url error : error) }
    }
    unsafe fn keysSortedByValueUsingSelector_(&self, comparator: objc::runtime::Sel) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , keysSortedByValueUsingSelector : comparator) }
    }
    unsafe fn getObjects_andKeys_count_(&self, objects: *mut id, keys: *mut id, count: NSUInteger)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getObjects : objects andKeys : keys count : count) }
    }
    unsafe fn objectForKeyedSubscript_(&self, key: id) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , objectForKeyedSubscript : key) }
    }
    unsafe fn enumerateKeysAndObjectsUsingBlock_(&self, block: *mut ::std::os::raw::c_void)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , enumerateKeysAndObjectsUsingBlock : block) }
    }
    unsafe fn enumerateKeysAndObjectsWithOptions_usingBlock_(
        &self,
        opts: NSEnumerationOptions,
        block: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , enumerateKeysAndObjectsWithOptions : opts usingBlock : block)
        }
    }
    unsafe fn keysSortedByValueUsingComparator_(&self, cmptr: NSComparator) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , keysSortedByValueUsingComparator : cmptr) }
    }
    unsafe fn keysSortedByValueWithOptions_usingComparator_(
        &self,
        opts: NSSortOptions,
        cmptr: NSComparator,
    ) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , keysSortedByValueWithOptions : opts usingComparator : cmptr) }
    }
    unsafe fn keysOfEntriesPassingTest_(&self, predicate: *mut ::std::os::raw::c_void) -> NSSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , keysOfEntriesPassingTest : predicate) }
    }
    unsafe fn keysOfEntriesWithOptions_passingTest_(
        &self,
        opts: NSEnumerationOptions,
        predicate: *mut ::std::os::raw::c_void,
    ) -> NSSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , keysOfEntriesWithOptions : opts passingTest : predicate) }
    }
    unsafe fn allKeys(&self) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allKeys) }
    }
    unsafe fn allValues(&self) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allValues) }
    }
    unsafe fn description(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, description) }
    }
    unsafe fn descriptionInStringsFileFormat(&self) -> NSString
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, descriptionInStringsFileFormat) }
    }
}
impl<KeyType: 'static, ObjectType: 'static> NSDictionary_NSDeprecated<KeyType, ObjectType>
    for NSDictionary
{
}
pub trait NSDictionary_NSDeprecated<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn getObjects_andKeys_(&self, objects: *mut id, keys: *mut id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , getObjects : objects andKeys : keys) }
    }
    unsafe fn initWithContentsOfFile_(&self, path: NSString) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfFile : path) }
    }
    unsafe fn initWithContentsOfURL_(&self, url: NSURL) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url) }
    }
    unsafe fn writeToFile_atomically_(&self, path: NSString, useAuxiliaryFile: BOOL) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToFile : path atomically : useAuxiliaryFile) }
    }
    unsafe fn writeToURL_atomically_(&self, url: NSURL, atomically: BOOL) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , writeToURL : url atomically : atomically) }
    }
    unsafe fn dictionaryWithContentsOfFile_(path: NSString) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , dictionaryWithContentsOfFile : path) }
    }
    unsafe fn dictionaryWithContentsOfURL_(url: NSURL) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , dictionaryWithContentsOfURL : url) }
    }
}
impl<KeyType: 'static, ObjectType: 'static> NSDictionary_NSDictionaryCreation<KeyType, ObjectType>
    for NSDictionary
{
}
pub trait NSDictionary_NSDictionaryCreation<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn initWithObjectsAndKeys_(&self, firstObject: id) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObjectsAndKeys : firstObject) }
    }
    unsafe fn initWithDictionary_(&self, otherDictionary: NSDictionary) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithDictionary : otherDictionary) }
    }
    unsafe fn initWithDictionary_copyItems_(
        &self,
        otherDictionary: NSDictionary,
        flag: BOOL,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithDictionary : otherDictionary copyItems : flag) }
    }
    unsafe fn initWithObjects_forKeys_(&self, objects: NSArray, keys: NSArray) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithObjects : objects forKeys : keys) }
    }
    unsafe fn initWithContentsOfURL_error_(&self, url: NSURL, error: *mut NSError) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url error : error) }
    }
    unsafe fn dictionary() -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(class!(NSDictionary), dictionary) }
    }
    unsafe fn dictionaryWithObject_forKey_(object: id, key: *mut u64) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , dictionaryWithObject : object forKey : key) }
    }
    unsafe fn dictionaryWithObjects_forKeys_count_(
        objects: *const *mut u64,
        keys: *const *mut u64,
        cnt: NSUInteger,
    ) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (class ! (NSDictionary) , dictionaryWithObjects : objects forKeys : keys count : cnt)
        }
    }
    unsafe fn dictionaryWithObjectsAndKeys_(firstObject: id) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , dictionaryWithObjectsAndKeys : firstObject) }
    }
    unsafe fn dictionaryWithDictionary_(dict: NSDictionary) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , dictionaryWithDictionary : dict) }
    }
    unsafe fn dictionaryWithObjects_forKeys_(objects: NSArray, keys: NSArray) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (class ! (NSDictionary) , dictionaryWithObjects : objects forKeys : keys)
        }
    }
    unsafe fn dictionaryWithContentsOfURL_error_(url: NSURL, error: *mut NSError) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (class ! (NSDictionary) , dictionaryWithContentsOfURL : url error : error)
        }
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSMutableDictionary(pub id);
impl std::ops::Deref for NSMutableDictionary {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSMutableDictionary {}
impl NSMutableDictionary {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSMutableDictionary), alloc) })
    }
}
impl<KeyType: 'static, ObjectType: 'static> INSDictionary<KeyType, ObjectType>
    for NSMutableDictionary
{
}
impl PNSCopying for NSMutableDictionary {}
impl PNSMutableCopying for NSMutableDictionary {}
impl PNSSecureCoding for NSMutableDictionary {}
impl PNSFastEnumeration for NSMutableDictionary {}
impl INSObject for NSMutableDictionary {}
impl PNSObject for NSMutableDictionary {}
impl From<NSMutableDictionary> for NSObject {
    fn from(child: NSMutableDictionary) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSMutableDictionary {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSMutableDictionary, Self::Error> {
        let is_kind_of: bool =
            unsafe { msg_send ! (parent , isKindOfClass : class ! (NSMutableDictionary)) };
        if is_kind_of {
            Ok(NSMutableDictionary(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSMutableDictionary")
        }
    }
}
impl<KeyType: 'static, ObjectType: 'static> INSMutableDictionary<KeyType, ObjectType>
    for NSMutableDictionary
{
}
pub trait INSMutableDictionary<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn removeObjectForKey_(&self, aKey: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectForKey : aKey) }
    }
    unsafe fn setObject_forKey_(&self, anObject: id, aKey: *mut u64)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setObject : anObject forKey : aKey) }
    }
    unsafe fn init(&self) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, init) }
    }
    unsafe fn initWithCapacity_(&self, numItems: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCapacity : numItems) }
    }
    unsafe fn initWithCoder_(&self, coder: NSCoder) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithCoder : coder) }
    }
}
impl<KeyType: 'static, ObjectType: 'static>
    NSMutableDictionary_NSExtendedMutableDictionary<KeyType, ObjectType> for NSMutableDictionary
{
}
pub trait NSMutableDictionary_NSExtendedMutableDictionary<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn addEntriesFromDictionary_(&self, otherDictionary: NSDictionary)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , addEntriesFromDictionary : otherDictionary) }
    }
    unsafe fn removeAllObjects(&self)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, removeAllObjects) }
    }
    unsafe fn removeObjectsForKeys_(&self, keyArray: NSArray)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , removeObjectsForKeys : keyArray) }
    }
    unsafe fn setDictionary_(&self, otherDictionary: NSDictionary)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setDictionary : otherDictionary) }
    }
    unsafe fn setObject_forKeyedSubscript_(&self, obj: id, key: *mut u64)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setObject : obj forKeyedSubscript : key) }
    }
}
impl<KeyType: 'static, ObjectType: 'static>
    NSMutableDictionary_NSMutableDictionaryCreation<KeyType, ObjectType> for NSMutableDictionary
{
}
pub trait NSMutableDictionary_NSMutableDictionaryCreation<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn initWithContentsOfFile_(&self, path: NSString) -> NSMutableDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfFile : path) }
    }
    unsafe fn initWithContentsOfURL_(&self, url: NSURL) -> NSMutableDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , initWithContentsOfURL : url) }
    }
    unsafe fn dictionaryWithCapacity_(numItems: NSUInteger) -> instancetype
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableDictionary) , dictionaryWithCapacity : numItems) }
    }
    unsafe fn dictionaryWithContentsOfFile_(path: NSString) -> NSMutableDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableDictionary) , dictionaryWithContentsOfFile : path) }
    }
    unsafe fn dictionaryWithContentsOfURL_(url: NSURL) -> NSMutableDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableDictionary) , dictionaryWithContentsOfURL : url) }
    }
}
impl<KeyType: 'static, ObjectType: 'static>
    NSDictionary_NSSharedKeySetDictionary<KeyType, ObjectType> for NSDictionary
{
}
pub trait NSDictionary_NSSharedKeySetDictionary<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn sharedKeySetForKeys_(keys: NSArray) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSDictionary) , sharedKeySetForKeys : keys) }
    }
}
impl<KeyType: 'static, ObjectType: 'static>
    NSMutableDictionary_NSSharedKeySetDictionary<KeyType, ObjectType> for NSMutableDictionary
{
}
pub trait NSMutableDictionary_NSSharedKeySetDictionary<KeyType: 'static, ObjectType: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn dictionaryWithSharedKeySet_(keyset: id) -> NSMutableDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (class ! (NSMutableDictionary) , dictionaryWithSharedKeySet : keyset) }
    }
}
impl<K: 'static, V: 'static> NSDictionary_NSGenericFastEnumeration<K, V> for NSDictionary {}
pub trait NSDictionary_NSGenericFastEnumeration<K: 'static, V: 'static>:
    Sized + std::ops::Deref
{
    unsafe fn countByEnumeratingWithState_objects_count_(
        &self,
        state: *mut NSFastEnumerationState,
        buffer: *mut id,
        len: NSUInteger,
    ) -> NSUInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , countByEnumeratingWithState : state objects : buffer count : len)
        }
    }
}
pub const NSDecodingFailurePolicy_NSDecodingFailurePolicyRaiseException: NSDecodingFailurePolicy =
    0;
pub const NSDecodingFailurePolicy_NSDecodingFailurePolicySetErrorAndReturn:
    NSDecodingFailurePolicy = 1;
pub type NSDecodingFailurePolicy = NSInteger;
#[repr(transparent)]
#[derive(Debug, Copy, Clone)]
pub struct NSCoder(pub id);
impl std::ops::Deref for NSCoder {
    type Target = objc::runtime::Object;
    fn deref(&self) -> &Self::Target {
        unsafe { &*self.0 }
    }
}
unsafe impl objc::Message for NSCoder {}
impl NSCoder {
    pub fn alloc() -> Self {
        Self(unsafe { msg_send!(class!(NSCoder), alloc) })
    }
}
impl INSObject for NSCoder {}
impl PNSObject for NSCoder {}
impl From<NSCoder> for NSObject {
    fn from(child: NSCoder) -> NSObject {
        NSObject(child.0)
    }
}
impl std::convert::TryFrom<NSObject> for NSCoder {
    type Error = &'static str;
    fn try_from(parent: NSObject) -> Result<NSCoder, Self::Error> {
        let is_kind_of: bool = unsafe { msg_send ! (parent , isKindOfClass : class ! (NSCoder)) };
        if is_kind_of {
            Ok(NSCoder(parent.0))
        } else {
            Err("This NSObject cannot be downcasted to NSCoder")
        }
    }
}
impl INSCoder for NSCoder {}
pub trait INSCoder: Sized + std::ops::Deref {
    unsafe fn encodeValueOfObjCType_at_(
        &self,
        type_: *const ::std::os::raw::c_char,
        addr: *const ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeValueOfObjCType : type_ at : addr) }
    }
    unsafe fn encodeDataObject_(&self, data: NSData)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeDataObject : data) }
    }
    unsafe fn decodeDataObject(&self) -> NSData
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, decodeDataObject) }
    }
    unsafe fn decodeValueOfObjCType_at_size_(
        &self,
        type_: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
        size: NSUInteger,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeValueOfObjCType : type_ at : data size : size) }
    }
    unsafe fn versionForClassName_(&self, className: NSString) -> NSInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , versionForClassName : className) }
    }
}
impl NSCoder_NSExtendedCoder for NSCoder {}
pub trait NSCoder_NSExtendedCoder: Sized + std::ops::Deref {
    unsafe fn encodeObject_(&self, object: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeObject : object) }
    }
    unsafe fn encodeRootObject_(&self, rootObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeRootObject : rootObject) }
    }
    unsafe fn encodeBycopyObject_(&self, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeBycopyObject : anObject) }
    }
    unsafe fn encodeByrefObject_(&self, anObject: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeByrefObject : anObject) }
    }
    unsafe fn encodeConditionalObject_(&self, object: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeConditionalObject : object) }
    }
    unsafe fn encodeValuesOfObjCTypes_(&self, types: *const ::std::os::raw::c_char)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeValuesOfObjCTypes : types) }
    }
    unsafe fn encodeArrayOfObjCType_count_at_(
        &self,
        type_: *const ::std::os::raw::c_char,
        count: NSUInteger,
        array: *const ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeArrayOfObjCType : type_ count : count at : array) }
    }
    unsafe fn encodeBytes_length_(
        &self,
        byteaddr: *const ::std::os::raw::c_void,
        length: NSUInteger,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeBytes : byteaddr length : length) }
    }
    unsafe fn decodeObject(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, decodeObject) }
    }
    unsafe fn decodeTopLevelObjectAndReturnError_(&self, error: *mut NSError) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeTopLevelObjectAndReturnError : error) }
    }
    unsafe fn decodeValuesOfObjCTypes_(&self, types: *const ::std::os::raw::c_char)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeValuesOfObjCTypes : types) }
    }
    unsafe fn decodeArrayOfObjCType_count_at_(
        &self,
        itemType: *const ::std::os::raw::c_char,
        count: NSUInteger,
        array: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeArrayOfObjCType : itemType count : count at : array) }
    }
    unsafe fn decodeBytesWithReturnedLength_(
        &self,
        lengthp: *mut NSUInteger,
    ) -> *mut ::std::os::raw::c_void
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeBytesWithReturnedLength : lengthp) }
    }
    unsafe fn encodePropertyList_(&self, aPropertyList: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodePropertyList : aPropertyList) }
    }
    unsafe fn decodePropertyList(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, decodePropertyList) }
    }
    unsafe fn setObjectZone_(&self, zone: *mut NSZone)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , setObjectZone : zone) }
    }
    unsafe fn objectZone(&self) -> *mut NSZone
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, objectZone) }
    }
    unsafe fn encodeObject_forKey_(&self, object: id, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeObject : object forKey : key) }
    }
    unsafe fn encodeConditionalObject_forKey_(&self, object: id, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeConditionalObject : object forKey : key) }
    }
    unsafe fn encodeBool_forKey_(&self, value: BOOL, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeBool : value forKey : key) }
    }
    unsafe fn encodeInt_forKey_(&self, value: ::std::os::raw::c_int, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeInt : value forKey : key) }
    }
    unsafe fn encodeInt32_forKey_(&self, value: i32, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeInt32 : value forKey : key) }
    }
    unsafe fn encodeInt64_forKey_(&self, value: i64, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeInt64 : value forKey : key) }
    }
    unsafe fn encodeFloat_forKey_(&self, value: f32, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeFloat : value forKey : key) }
    }
    unsafe fn encodeDouble_forKey_(&self, value: f64, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeDouble : value forKey : key) }
    }
    unsafe fn encodeBytes_length_forKey_(&self, bytes: *const u8, length: NSUInteger, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeBytes : bytes length : length forKey : key) }
    }
    unsafe fn containsValueForKey_(&self, key: NSString) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , containsValueForKey : key) }
    }
    unsafe fn decodeObjectForKey_(&self, key: NSString) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeObjectForKey : key) }
    }
    unsafe fn decodeTopLevelObjectForKey_error_(&self, key: NSString, error: *mut NSError) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeTopLevelObjectForKey : key error : error) }
    }
    unsafe fn decodeBoolForKey_(&self, key: NSString) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeBoolForKey : key) }
    }
    unsafe fn decodeIntForKey_(&self, key: NSString) -> ::std::os::raw::c_int
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeIntForKey : key) }
    }
    unsafe fn decodeInt32ForKey_(&self, key: NSString) -> i32
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeInt32ForKey : key) }
    }
    unsafe fn decodeInt64ForKey_(&self, key: NSString) -> i64
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeInt64ForKey : key) }
    }
    unsafe fn decodeFloatForKey_(&self, key: NSString) -> f32
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeFloatForKey : key) }
    }
    unsafe fn decodeDoubleForKey_(&self, key: NSString) -> f64
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeDoubleForKey : key) }
    }
    unsafe fn decodeBytesForKey_returnedLength_(
        &self,
        key: NSString,
        lengthp: *mut NSUInteger,
    ) -> *const u8
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeBytesForKey : key returnedLength : lengthp) }
    }
    unsafe fn encodeInteger_forKey_(&self, value: NSInteger, key: NSString)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeInteger : value forKey : key) }
    }
    unsafe fn decodeIntegerForKey_(&self, key: NSString) -> NSInteger
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeIntegerForKey : key) }
    }
    unsafe fn decodeObjectOfClass_forKey_(&self, aClass: Class, key: NSString) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeObjectOfClass : aClass forKey : key) }
    }
    unsafe fn decodeTopLevelObjectOfClass_forKey_error_(
        &self,
        aClass: Class,
        key: NSString,
        error: *mut NSError,
    ) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , decodeTopLevelObjectOfClass : aClass forKey : key error : error)
        }
    }
    unsafe fn decodeArrayOfObjectsOfClass_forKey_(&self, cls: Class, key: NSString) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeArrayOfObjectsOfClass : cls forKey : key) }
    }
    unsafe fn decodeDictionaryWithKeysOfClass_objectsOfClass_forKey_(
        &self,
        keyCls: Class,
        objectCls: Class,
        key: NSString,
    ) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , decodeDictionaryWithKeysOfClass : keyCls objectsOfClass : objectCls forKey : key)
        }
    }
    unsafe fn decodeObjectOfClasses_forKey_(&self, classes: NSSet, key: NSString) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeObjectOfClasses : classes forKey : key) }
    }
    unsafe fn decodeTopLevelObjectOfClasses_forKey_error_(
        &self,
        classes: NSSet,
        key: NSString,
        error: *mut NSError,
    ) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , decodeTopLevelObjectOfClasses : classes forKey : key error : error)
        }
    }
    unsafe fn decodeArrayOfObjectsOfClasses_forKey_(&self, classes: NSSet, key: NSString) -> NSArray
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeArrayOfObjectsOfClasses : classes forKey : key) }
    }
    unsafe fn decodeDictionaryWithKeysOfClasses_objectsOfClasses_forKey_(
        &self,
        keyClasses: NSSet,
        objectClasses: NSSet,
        key: NSString,
    ) -> NSDictionary
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe {
            msg_send ! (* self , decodeDictionaryWithKeysOfClasses : keyClasses objectsOfClasses : objectClasses forKey : key)
        }
    }
    unsafe fn decodePropertyListForKey_(&self, key: NSString) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodePropertyListForKey : key) }
    }
    unsafe fn failWithError_(&self, error: NSError)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , failWithError : error) }
    }
    unsafe fn systemVersion(&self) -> ::std::os::raw::c_uint
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, systemVersion) }
    }
    unsafe fn allowsKeyedCoding(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allowsKeyedCoding) }
    }
    unsafe fn requiresSecureCoding(&self) -> BOOL
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, requiresSecureCoding) }
    }
    unsafe fn allowedClasses(&self) -> NSSet
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, allowedClasses) }
    }
    unsafe fn decodingFailurePolicy(&self) -> NSDecodingFailurePolicy
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, decodingFailurePolicy) }
    }
    unsafe fn error(&self) -> NSError
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, error) }
    }
}
unsafe extern "C" {
    pub fn NXReadNSObjectFromCoder(decoder: NSCoder) -> NSObject;
}
impl NSCoder_NSTypedstreamCompatibility for NSCoder {}
pub trait NSCoder_NSTypedstreamCompatibility: Sized + std::ops::Deref {
    unsafe fn encodeNXObject_(&self, object: id)
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , encodeNXObject : object) }
    }
    unsafe fn decodeNXObject(&self) -> id
    where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send!(*self, decodeNXObject) }
    }
}
impl NSCoder_NSDeprecated for NSCoder {}
pub trait NSCoder_NSDeprecated: Sized + std::ops::Deref {
    unsafe fn decodeValueOfObjCType_at_(
        &self,
        type_: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ) where
        <Self as std::ops::Deref>::Target: objc::Message + Sized,
    {
        unsafe { msg_send ! (* self , decodeValueOfObjCType : type_ at : data) }
    }
}
unsafe extern "C" {
    pub fn __assert_rtn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> !;
}
pub type wint_t = __darwin_wint_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneEntry {
    pub __min: __darwin_rune_t,
    pub __max: __darwin_rune_t,
    pub __map: __darwin_rune_t,
    pub __types: *mut __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RuneEntry"][::std::mem::size_of::<_RuneEntry>() - 24usize];
    ["Alignment of _RuneEntry"][::std::mem::align_of::<_RuneEntry>() - 8usize];
    ["Offset of field: _RuneEntry::__min"][::std::mem::offset_of!(_RuneEntry, __min) - 0usize];
    ["Offset of field: _RuneEntry::__max"][::std::mem::offset_of!(_RuneEntry, __max) - 4usize];
    ["Offset of field: _RuneEntry::__map"][::std::mem::offset_of!(_RuneEntry, __map) - 8usize];
    ["Offset of field: _RuneEntry::__types"][::std::mem::offset_of!(_RuneEntry, __types) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneRange {
    pub __nranges: ::std::os::raw::c_int,
    pub __ranges: *mut _RuneEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RuneRange"][::std::mem::size_of::<_RuneRange>() - 16usize];
    ["Alignment of _RuneRange"][::std::mem::align_of::<_RuneRange>() - 8usize];
    ["Offset of field: _RuneRange::__nranges"]
        [::std::mem::offset_of!(_RuneRange, __nranges) - 0usize];
    ["Offset of field: _RuneRange::__ranges"]
        [::std::mem::offset_of!(_RuneRange, __ranges) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneCharClass {
    pub __name: [::std::os::raw::c_char; 14usize],
    pub __mask: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RuneCharClass"][::std::mem::size_of::<_RuneCharClass>() - 20usize];
    ["Alignment of _RuneCharClass"][::std::mem::align_of::<_RuneCharClass>() - 4usize];
    ["Offset of field: _RuneCharClass::__name"]
        [::std::mem::offset_of!(_RuneCharClass, __name) - 0usize];
    ["Offset of field: _RuneCharClass::__mask"]
        [::std::mem::offset_of!(_RuneCharClass, __mask) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneLocale {
    pub __magic: [::std::os::raw::c_char; 8usize],
    pub __encoding: [::std::os::raw::c_char; 32usize],
    pub __sgetrune: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: __darwin_size_t,
            arg3: *mut *const ::std::os::raw::c_char,
        ) -> __darwin_rune_t,
    >,
    pub __sputrune: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: __darwin_rune_t,
            arg2: *mut ::std::os::raw::c_char,
            arg3: __darwin_size_t,
            arg4: *mut *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub __invalid_rune: __darwin_rune_t,
    pub __runetype: [__uint32_t; 256usize],
    pub __maplower: [__darwin_rune_t; 256usize],
    pub __mapupper: [__darwin_rune_t; 256usize],
    pub __runetype_ext: _RuneRange,
    pub __maplower_ext: _RuneRange,
    pub __mapupper_ext: _RuneRange,
    pub __variable: *mut ::std::os::raw::c_void,
    pub __variable_len: ::std::os::raw::c_int,
    pub __ncharclasses: ::std::os::raw::c_int,
    pub __charclasses: *mut _RuneCharClass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RuneLocale"][::std::mem::size_of::<_RuneLocale>() - 3208usize];
    ["Alignment of _RuneLocale"][::std::mem::align_of::<_RuneLocale>() - 8usize];
    ["Offset of field: _RuneLocale::__magic"]
        [::std::mem::offset_of!(_RuneLocale, __magic) - 0usize];
    ["Offset of field: _RuneLocale::__encoding"]
        [::std::mem::offset_of!(_RuneLocale, __encoding) - 8usize];
    ["Offset of field: _RuneLocale::__sgetrune"]
        [::std::mem::offset_of!(_RuneLocale, __sgetrune) - 40usize];
    ["Offset of field: _RuneLocale::__sputrune"]
        [::std::mem::offset_of!(_RuneLocale, __sputrune) - 48usize];
    ["Offset of field: _RuneLocale::__invalid_rune"]
        [::std::mem::offset_of!(_RuneLocale, __invalid_rune) - 56usize];
    ["Offset of field: _RuneLocale::__runetype"]
        [::std::mem::offset_of!(_RuneLocale, __runetype) - 60usize];
    ["Offset of field: _RuneLocale::__maplower"]
        [::std::mem::offset_of!(_RuneLocale, __maplower) - 1084usize];
    ["Offset of field: _RuneLocale::__mapupper"]
        [::std::mem::offset_of!(_RuneLocale, __mapupper) - 2108usize];
    ["Offset of field: _RuneLocale::__runetype_ext"]
        [::std::mem::offset_of!(_RuneLocale, __runetype_ext) - 3136usize];
    ["Offset of field: _RuneLocale::__maplower_ext"]
        [::std::mem::offset_of!(_RuneLocale, __maplower_ext) - 3152usize];
    ["Offset of field: _RuneLocale::__mapupper_ext"]
        [::std::mem::offset_of!(_RuneLocale, __mapupper_ext) - 3168usize];
    ["Offset of field: _RuneLocale::__variable"]
        [::std::mem::offset_of!(_RuneLocale, __variable) - 3184usize];
    ["Offset of field: _RuneLocale::__variable_len"]
        [::std::mem::offset_of!(_RuneLocale, __variable_len) - 3192usize];
    ["Offset of field: _RuneLocale::__ncharclasses"]
        [::std::mem::offset_of!(_RuneLocale, __ncharclasses) - 3196usize];
    ["Offset of field: _RuneLocale::__charclasses"]
        [::std::mem::offset_of!(_RuneLocale, __charclasses) - 3200usize];
};
unsafe extern "C" {
    pub static mut _DefaultRuneLocale: _RuneLocale;
}
unsafe extern "C" {
    pub static mut _CurrentRuneLocale: *mut _RuneLocale;
}
unsafe extern "C" {
    pub fn ___runetype(arg1: __darwin_ct_rune_t) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ___tolower(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
unsafe extern "C" {
    pub fn ___toupper(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
unsafe extern "C" {
    pub fn __maskrune(
        arg1: __darwin_ct_rune_t,
        arg2: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __toupper(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
unsafe extern "C" {
    pub fn __tolower(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
unsafe extern "C" {
    pub fn __error() -> *mut ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lconv {
    pub decimal_point: *mut ::std::os::raw::c_char,
    pub thousands_sep: *mut ::std::os::raw::c_char,
    pub grouping: *mut ::std::os::raw::c_char,
    pub int_curr_symbol: *mut ::std::os::raw::c_char,
    pub currency_symbol: *mut ::std::os::raw::c_char,
    pub mon_decimal_point: *mut ::std::os::raw::c_char,
    pub mon_thousands_sep: *mut ::std::os::raw::c_char,
    pub mon_grouping: *mut ::std::os::raw::c_char,
    pub positive_sign: *mut ::std::os::raw::c_char,
    pub negative_sign: *mut ::std::os::raw::c_char,
    pub int_frac_digits: ::std::os::raw::c_char,
    pub frac_digits: ::std::os::raw::c_char,
    pub p_cs_precedes: ::std::os::raw::c_char,
    pub p_sep_by_space: ::std::os::raw::c_char,
    pub n_cs_precedes: ::std::os::raw::c_char,
    pub n_sep_by_space: ::std::os::raw::c_char,
    pub p_sign_posn: ::std::os::raw::c_char,
    pub n_sign_posn: ::std::os::raw::c_char,
    pub int_p_cs_precedes: ::std::os::raw::c_char,
    pub int_n_cs_precedes: ::std::os::raw::c_char,
    pub int_p_sep_by_space: ::std::os::raw::c_char,
    pub int_n_sep_by_space: ::std::os::raw::c_char,
    pub int_p_sign_posn: ::std::os::raw::c_char,
    pub int_n_sign_posn: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lconv"][::std::mem::size_of::<lconv>() - 96usize];
    ["Alignment of lconv"][::std::mem::align_of::<lconv>() - 8usize];
    ["Offset of field: lconv::decimal_point"]
        [::std::mem::offset_of!(lconv, decimal_point) - 0usize];
    ["Offset of field: lconv::thousands_sep"]
        [::std::mem::offset_of!(lconv, thousands_sep) - 8usize];
    ["Offset of field: lconv::grouping"][::std::mem::offset_of!(lconv, grouping) - 16usize];
    ["Offset of field: lconv::int_curr_symbol"]
        [::std::mem::offset_of!(lconv, int_curr_symbol) - 24usize];
    ["Offset of field: lconv::currency_symbol"]
        [::std::mem::offset_of!(lconv, currency_symbol) - 32usize];
    ["Offset of field: lconv::mon_decimal_point"]
        [::std::mem::offset_of!(lconv, mon_decimal_point) - 40usize];
    ["Offset of field: lconv::mon_thousands_sep"]
        [::std::mem::offset_of!(lconv, mon_thousands_sep) - 48usize];
    ["Offset of field: lconv::mon_grouping"][::std::mem::offset_of!(lconv, mon_grouping) - 56usize];
    ["Offset of field: lconv::positive_sign"]
        [::std::mem::offset_of!(lconv, positive_sign) - 64usize];
    ["Offset of field: lconv::negative_sign"]
        [::std::mem::offset_of!(lconv, negative_sign) - 72usize];
    ["Offset of field: lconv::int_frac_digits"]
        [::std::mem::offset_of!(lconv, int_frac_digits) - 80usize];
    ["Offset of field: lconv::frac_digits"][::std::mem::offset_of!(lconv, frac_digits) - 81usize];
    ["Offset of field: lconv::p_cs_precedes"]
        [::std::mem::offset_of!(lconv, p_cs_precedes) - 82usize];
    ["Offset of field: lconv::p_sep_by_space"]
        [::std::mem::offset_of!(lconv, p_sep_by_space) - 83usize];
    ["Offset of field: lconv::n_cs_precedes"]
        [::std::mem::offset_of!(lconv, n_cs_precedes) - 84usize];
    ["Offset of field: lconv::n_sep_by_space"]
        [::std::mem::offset_of!(lconv, n_sep_by_space) - 85usize];
    ["Offset of field: lconv::p_sign_posn"][::std::mem::offset_of!(lconv, p_sign_posn) - 86usize];
    ["Offset of field: lconv::n_sign_posn"][::std::mem::offset_of!(lconv, n_sign_posn) - 87usize];
    ["Offset of field: lconv::int_p_cs_precedes"]
        [::std::mem::offset_of!(lconv, int_p_cs_precedes) - 88usize];
    ["Offset of field: lconv::int_n_cs_precedes"]
        [::std::mem::offset_of!(lconv, int_n_cs_precedes) - 89usize];
    ["Offset of field: lconv::int_p_sep_by_space"]
        [::std::mem::offset_of!(lconv, int_p_sep_by_space) - 90usize];
    ["Offset of field: lconv::int_n_sep_by_space"]
        [::std::mem::offset_of!(lconv, int_n_sep_by_space) - 91usize];
    ["Offset of field: lconv::int_p_sign_posn"]
        [::std::mem::offset_of!(lconv, int_p_sign_posn) - 92usize];
    ["Offset of field: lconv::int_n_sign_posn"]
        [::std::mem::offset_of!(lconv, int_n_sign_posn) - 93usize];
};
unsafe extern "C" {
    pub fn localeconv() -> *mut lconv;
}
unsafe extern "C" {
    pub fn setlocale(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __math_errhandling() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyd(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyl(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ilogb(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
